[
  {
    "post_id":"10ve5g7",
    "post_content":"I am currently 24 weeks pregnant with my third child. I currently have an 8 year old son and 1 year old daughter. I have been in a rocky relationship with their dad coming up 10 years. He has a majurana dependency which has caused a majority of issues in our relationship. As a non-smoker I'm not against him smoking. It's the financial burden (Spending up to $400 weekly) and time spent away from us (eg smoking with friends and family on a almost daily basis) that causes me to feel frustrated. When ever I bring up how I feel it causes major arguments and ends up in him telling me I'm controlling and he ends up taking off to his parents who tend to baby and enable him. He does help out with the kids after he has his \"Smoking time away\" i just wish we were higher on his priority list. Am I over reacting?",
    "post_title":"AITA for wanting my partner to prioritize his family before his habits?",
    "verdict":"NTA"
  },
  {
    "post_id":"10td7v6",
    "post_content":"On the way to the beer store I called the Wife and asked how many six packs I should buy for the night. The conclusion is that we should get 2x  six packs - In her words \"We'll split one, and save the other for tomorrow\" . I then bought them and when I got home put one in the fridge and one on the counter (I like them cold and she does not) and brought us over one beer each. Later she gets up to bring us another one each and is irritated that we are not indeed sharing a six pack. I explain that we can have 3 each out of the respective packs and have the same amount left over for tomorrow as per the plan. With the sole exception that I get cold ones, and she gets warm ones. Apparently I am wrong because somehow 2x(1\/2) a six pack Does not equal 1x six pack. Is this not equivalent? Is she justified for flying off the handle at this or am I the asshole?",
    "post_title":"AITA The missus and I had a disagreement about Beer",
    "verdict":"NTA"
  },
  {
    "post_id":"10wwo3a",
    "post_content":"My friend and I have wanted to go to travelling for a month for a while but haven't had any solid plans as I have needed to save and it's difficult for me to get a month off work. About two and a half years ago I met my current bf and we fell in love etc. He has always wanted to travel too so I invited him. Now we have started saving and formally requested leave my friend is saying she feels like a third wheel and is thinking of not going. I feel terrible and after writing this feel like I should have spoke to her beforehand but now I feel like it would be weird to un invite my bf. Aita?",
    "post_title":"AITA for inviting my bf travelling",
    "verdict":"YTA"
  },
  {
    "post_id":"10v1ubv",
    "post_content":"I, 19F am a manager at a fast food restaurant (it is not a McDonald’s or anything) and I work with people who are generally between 17-22, our boss is 20. I have two co workers, Thomas, 18M &amp; Jackory, 17M who I’m in reference to.<br/>Today, I worked an 8 hour shift, and jackory, he’s still new (has been here about a month) works the line with me and instead of calling me by my name, he says “yes ma’am” and things like that as if we aren’t in the same age group. I find that to be highly disrespectful for him to address me as “ma’am” as if I’m an elder or a senior and Thomas does the same thing. I asked him why he kept doing that and said “why do you keep saying yes ma’am like I’m old or something?” He apologized, but I caught him doing it again. I have been considering talking to my boss about this and I’m hoping she can have a conversation with him about it. My cousin thinks I’m exaggerating a bit, but I don’t think I am. Am I the asshole?",
    "post_title":"AITA for telling my co workers to stop disrespecting me?",
    "verdict":"YTA"
  },
  {
    "post_id":"10usgbf",
    "post_content":"My wife (26F) will neurotically ask me (29M) questions for reassurance. For example, when we leave the house for several hours, she will ask me whether our dog will be alright (while we’re gone). When I provide an honest answer (“I don’t know”), she becomes extremely hostile and upset toward me. Therefore, my lone option is to say, “yes,” or else an argument will ensue. Obviously, I suspect our dog will be fine, but cannot guarantee it (e.<br/>g., house fire, burglars, etc). It is an average dog being left alone in an average home located in an average neighborhood.<br/>The question irritates me because I have no additional insight into whether our dog will be alright. My wife knows that. I am not veterinarian, nor can I see into the future. So, why continue to ask me the same asinine question? Accordingly, AITA for responding with, “I don’t know.”",
    "post_title":"AITA for not entertaining my wife’s frivolous questions?",
    "verdict":"YTA"
  },
  {
    "post_id":"10x4h69",
    "post_content":"Title pretty much explains myself, but I’ll elaborate:My partner and I have been living together for about a year and some change now. Recently, we got into an argument because I said “I feel like you don’t do much of anything to help out around the apartment,” during a period of heated discussion. Context here: I am a full time student, I work a part time job, I do the cooking, laundry, grocery shopping, and am generally the person who does most of the cleaning. He does the dishes and mops maybe once or twice a month. He is in the Armed Forces, and works like a 7:30am-2:00pm or 3:00pm workday. He says I don’t really get it because I don’t do, nor have I ever, worked in manual labor. Am I being unreasonable? I just got into grad school yesterday and he didn’t really offer much congratulations until I asked. Just feeling a bit sour about the whole thing and wanted to see what the Internet has to say about this.",
    "post_title":"AITA for asking my partner to do more around the house?",
    "verdict":"NTA"
  },
  {
    "post_id":"10wpkws",
    "post_content":"I (22) live in a house with 3 other girls. On of them (38) has a habit of leaving food in the fridge that she refuses to throw away. She bought a yoghurt pot back in November and it was still in the fridge until yesterday when I had enough it and threw it. It was completely blue and the smell was nauseating. We had a mutual understanding in the house that if the food in the fridge goes bad, it gets thrown away, especially because we share the shelves and the smell ends up going everywhere.<br/>I was already annoyed with this housemate because she split liquid mushrooms literally everywhere in the fridge and it went on everything so I had to clean it up since she didn’t do it properly. Again, the smell was atrocious. I didn’t really think me throwing away her yoghurt pot from four months ago was a big deal but she confronted me about how I had no right before threatening to report me to the police for theft. So AITA?",
    "post_title":"AITA for throwing away my housemates food",
    "verdict":"NTA"
  },
  {
    "post_id":"10ztkxr",
    "post_content":"Short post. Kids recently got hoverboards, don’t worry we checked the ages and they’re appropriate + only used were safe, like our garden and with helmets.<br/>Kids are great on them, no accidents and they love them.<br/>Wife decided to try one out, insisted on our daughter (12) holding her hand - daughter did then snatched her hand away and my wife fell over.<br/>Wife laughed it off and so did I , she called it giggling though but I don’t really think it was, must’ve been worse than we thought though because we were in ER because of her wrist (it’s sprained and she’s got some back pain)She called me out for laughing earlier, I said I wouldn’t have had I known she was hurt or if she didn’t laugh.<br/>She wants an apology, I think she’s overreacting because I wouldn’t have laughed if I knew she was hurt - she didn’t even know she was that hurt. AITA? Might be missing info but I’m in a rush",
    "post_title":"AITA for “giggling” after my wife fell over?",
    "verdict":"YTA"
  },
  {
    "post_id":"1102odc",
    "post_content":"So my daughter dropped a phone into the toilet and my wife immediately took the phone out of the case and put it in rice.<br/>In the past I told her the rice hack is a myth, but she believes and now I don't bring it up anymore. However when I saw she put the phone into our pantry rice I asked why she needed so much for a phone. We have to throw it all out now.<br/>She said it's okay, when we cook it, the germs will be dead. When I explained all the ways that doesn't work, she got mad and said I can buy my own rice, because I was insulting her native culture. Oh...She didn't talk to me for 45 minutes then we argued again and she threw all the toilet rice out.  I thanked her, hugged and took out the trash.<br/>When I come back she's filling the old contaminated container with new rice. Rather than argue, I'm going to throw out the new rice and clean the container myself and refill, if we have any left in the bag.",
    "post_title":"AITA for not wanting to eat toilet rice?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uwiue",
    "post_content":"This happened in high school, but one day a classmate brought in treats for the class. I was infuriated because there was another event going on at the same time to memorialize the dead. It was personal for me because I lost a friend a year prior and it felt really disrespectful to me. The classmate ended up crying but I apologized the nest day.<br/>Later at graduation I was class speaker and mentioned what happened at the end of my speech. AITA?<br/>Edit: They went to go get treats when the memorial was happening. It was only about a 20 minute memorial.",
    "post_title":"AITA for scolding my classmate's actions and bringing it up again at graduation?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xou71",
    "post_content":"One night I turned on the dryer at 1am and found a note on my door the next day saying not to run the dryer at night because it makes a lot of noise. I got management to take a look at the dryer but they said nothing they could do noise wise, it was fine. So I just avoided running it at night. 11 MONTHS later, I had come back from a trip and needed to run the dryer. It was 11pm, neighbor comes down immediately and tells me to turn it off. I explain the situation and say I could turn it off in 40 minutes. Neighbor says that doesn’t work for him, it would be better if I turn it off now. Said I didn’t want my clothes ruined, keeping it on. I didn’t turn it off. Am I the asshole?",
    "post_title":"AITA for not turning off the dryer?",
    "verdict":"YTA"
  },
  {
    "post_id":"10vhwmx",
    "post_content":"I (37F) have a close friend (39F) who needs therapy. She asked if I could send her my therapist’s information (I have a good therapist) and I feel extremely uncomfortable about her seeing my therapist. Is this normal to feel weird about this? AITA? TL;DR: close friend asked to see my therapist for help and it makes me uncomfortable.<br/>Edit to add: I’m not uncomfortable because I think they’ll talk about me, I know that’s illegal and I know he wouldn’t disclose my information to another client of his.<br/>Second edit: I’ve never discussed this friend with my therapist and wouldn’t have a reason to do so, it isn’t a fear of my personal information being disclosed, etc",
    "post_title":"WIBTA if I asked my best friend to not see my therapist and pick another?",
    "verdict":"NTA"
  },
  {
    "post_id":"10wm5vu",
    "post_content":"For context me and my fiance are staying at her mom's house. They have 3 dogs who all only eat human food. I don't agree with this, but there is no changing their mind... Tonight after a long days work I made a sandwich for myself for dinner. That's it, just one sandwich nothing else to go with it. The rest of the family was eating fish, but I couldn't have that sense I'm allergic. After I made my sandwich and stood to eat in the kitchen sense the table was full, they started saying. Oh this dog loves sandwiches. Give her some. I was like uh, this is my dinner I'm not sharing my whole one sandwich with a dog. It's all I made to eat. They kept pressing me to give the dog my sandwich so I ended up giving her 3\/4 of my sandwich because I just didn't want to argue anymore. Now I have nothing left to make for dinner and I'm just gonna go to bed hungry. They think I'm an asshole because I didn't want to share my food with the dog. So, am I the asshole?",
    "post_title":"AITA For not wanting to share my sandwich with the dog?",
    "verdict":"NTA"
  },
  {
    "post_id":"10tpuvf",
    "post_content":"My roommate is quiet for the most part but ever since she moved in I haven’t been getting much sleep. She slams doors and has loud sex which wakes me up. I have asked her on two separate occasions to keep the volume down and to not slam doors. It stopped but only for that day. Her bf now lives with us too which makes me uncomfortable. I’m thinking about reporting her to the shirt. I just want some sleep. Ps we live in the barracks",
    "post_title":"AITA for potentially reporting roommate",
    "verdict":"NTA"
  },
  {
    "post_id":"10wnxg8",
    "post_content":"Hey. My (28F) sister (31F) is getting married on Saturday. We RSVP'd yes, and we're fully intending on travelling the 3-4 hours to stay close to the venue. I recently had a baby (3 months F) and we were 100% on board with her coming to the wedding, since everyone's kids are coming. The issue is, my husband has become really sick, as in runny nose, chesty cough, headaches, congestion the works.  (Thankfully not covid) Because he's become so sick, I'm inclined not to go to the wedding, but also because my Granddad who just had Whipple surgery due to pancreatic cancer, cannot get sick. It would be life threatening. I've been isolating from my husband since the first symptom appeared, yet I'm unwilling to leave him when he's so sick and I'm not 100% sure I haven't got it. WIBTA if I stayed away from the wedding? *on mobile*",
    "post_title":"WIBTA for not going to my sisters wedding?",
    "verdict":"NTA"
  },
  {
    "post_id":"10zumd3",
    "post_content":"I let my good friend listen in on a conversation between me and my roommate because he keeps saying I’m trying to manipulate his feelings. I’m a female and he is male we are both straight and are good friends.<br/>First he likes to tell me what to do and get mad if I don’t do it. He comes in my room to tell me we are just friends. I do get why he had to do that but he keeps doing that. He calls me all the time morning and night. Out the blue tells me I need to date and I should go to a bar alone ps I don’t have a car.",
    "post_title":"AITA for letting my friend listen on FaceTime a conversation with my roommate\/other friend",
    "verdict":"NTA"
  },
  {
    "post_id":"10wr3fy",
    "post_content":"My wife is all about eating healthy. We hardly ever get any junkfood.<br/>My daughter(11F) and I(M32) love junkfood so we've got a secret stash of things we like. Yesterday I went to get something to eat and decided to eat the last twixA few hours later my daughter went to get something to eat and she asked me where the last twix is. I said I ate it. She thinks I'm an asshole because twix is her favorite but I like it too why does she get all of it? And I'm the one paying.<br/>Meanwhile my wife found out about our secret and she thinks we are both assholes for going behind her back so I can't buy another chocolate for her and she is sulking now",
    "post_title":"AITA for eating my daughter's favorite chocolate?",
    "verdict":"YTA"
  },
  {
    "post_id":"10ur5x6",
    "post_content":"I’m taking an online, asynchronous biochem course this semester. We have a midterm tomorrow on the first 9 sections (~month’s work on material if you follow the recommended course schedule). Someone from the course messaged me on Facebook asking for my notes, she got my profile from the course group chat to message me privately. Under most circumstances I would share my notes, but this girl messaged me saying she hadn’t watched any lecture videos (she downloaded the slides and read them), she wasn’t aware there would be lecture content on the midterm and if I had notes I could send her. I do, I have a really well organized word doc of the first 9 sections that I spent hours creating and I don’t feel like sharing it with someone whose just told me they haven’t done anything for the course. I feel bad because it really does not impact my life at all if I share my notes, so I’m being a little petty. AITA?",
    "post_title":"AITA for not sharing my notes?",
    "verdict":"NTA"
  },
  {
    "post_id":"10y11i5",
    "post_content":"My friend and so haven’t seen each other in over 6 months so we planned to meet up. We don’t live close so we were both going to meet in a location closer to the middle. For this I said I would travel further and even stay with family in the area so that it would work out. We have had these plans for weeks and I was supposed to leave after work to drive the 2.5 hours it takes to get there. I work up this morning to a text saying that they wanted to go but the timing will no longer work out since it’s a lot of travel after work. I am mostly annoyed Becuase I am completely not surprised by the cancelation as they have done this many times. AITA for getting annoyed with them?",
    "post_title":"AITA for getting mad at my friend for canceling last minute?",
    "verdict":"NTA"
  },
  {
    "post_id":"10z091w",
    "post_content":"Forgive the format I'm writing from my phone and also English is not my first language. So for a little background, my(22F) cousin(23M) made plans to get away with our partners one weekend where we split the costs equally so as to be able to afford it. For accommodation we decided on a self catering place and to confirm the booking a non refundable fee had to be paid and the rest to be paid on check in . I paid the deposit and the booking was confirmed.  Fast forward a week before the time we were supposed to leave my cousin just cancelled without giving a reason. My boyfriend and I  can't go cause we won't be able to afford it without these guys meaning the deposit i paid is going to be lost . So i asked my cousin that it is no fault of mine that the trip is cancelled and I can't carry the loss alone . I agreed to lose 10% . Everyone around us is saying TA for doing that.<br/>So AITA fir making my cousin pay me back",
    "post_title":"AITA FOR MAKING MY COUSIN PAY ME BACK THE MONEY I SPENT",
    "verdict":"YTA"
  },
  {
    "post_id":"10wbklk",
    "post_content":"Brief background to begin with. I am 34, been married to my wife for 8 years and we have a son who is 2. My wife has had a dog all her life  and we have a dog now too, we see it as the family dog ​​but it is on her initiative that we have a dog.<br/>Last summer, my parents invited all their children, with families, to a large zoo for 2 days with an overnight stay.<br/>My mother turned 60 and wanted to treat the family to a nice weekend.<br/>Just before departure, our dog became ill and needed to go to the vet. My wife wanted us all to stay at home, but I thought she could stay home with the dog and that I should take our son and go to the zoo and see my family.<br/>She was very angry and thought it was incredibly selfish of me too leave her with the dog.<br/>Our dog had problems with his stomach from time to time, but it was never life threatening.<br/>I ended up leaving late in the afternoon and barely had time to see the family that day, and the next day my wife came by train and joined us at the zoo on day 2.",
    "post_title":"AITA for leaving my wife at home with our sick dog to see my family?",
    "verdict":"NTA"
  },
  {
    "post_id":"10yq0zv",
    "post_content":"AITA for wanting to rest on my anniversary? I 63(M) and my wife 57(F) have been married for 30 years when I was younger I use to have more energy and working 40+ hours a week didn't take a toll on my body. But now it does and I'm more tired than usual, our anniversary rolls around quicker than the flash. She (my wife) wants to go out for dinner and have a movie night but I explain to her how work has been tiresome and I needed to have a break. She got angry and left the house, Im currently sleeping in the guestroom. AITA?<br/>Edit : It's a Monday, so it's not the best time.",
    "post_title":"AITA For Wanting To Rest On My Anniversary?",
    "verdict":"YTA"
  },
  {
    "post_id":"10zaucm",
    "post_content":"Me and my mom were shopping at a local thriftstore when I noticed a large man following me, I immediately walked back to where my mom was and informed her about what was happening. I ended up sticking by her side for a while until eventually the man approached me. He did not say a single word and was carrying childrens books, at first he simply stood there before moving very close to me. My mom encouraged me to talk to him so I said hi, he then started mumbling something and grabbed my hands, feeling very uncomfortable I pulled away and started to walk in the other direction but he followed me. Eventually I felt so uncomfortable that I ran from the store and hid in my locked car, when my mom came out she immediately began scolding me for running away from a man who likely had no idea what he was doing. I do feel a bit bad but I still feel that I was right to leave the situation as quickly as possibleAITA?",
    "post_title":"AITA for running away from a possibly mentally ill person in public",
    "verdict":"NTA"
  },
  {
    "post_id":"10ysene",
    "post_content":"My grandmother asked me two days prior if I wanted to go to the museum with her and I told her I would think about it. I never said yes. She bought both of our tickets ($27) for a morning showing at 10am to 1pm. I work from 12pm - 12am. She said she wanted to leave at 5am so we could beat traffic and offered to drive but I said I had work but she asked if I had a sick day I could take. She woke me up at 4:30am, asked if I was ready and I said I never told her yes. She said “okay fine, I’ll just waste my money”. I paid her $40 and she left. I know that she wants to spend time with me and I love her but I feel like she was being inconsiderate. AITA?(Sidenote: The special viewing is the last day the exhibit will be there until next year. She wanted to go)",
    "post_title":"AITA For not going with my grandmother to the museum?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z0kkg",
    "post_content":"I am recovering from an injury sustained in a bike accident. My wife and I had planned to do a big (for her) ride together last year (London to Brighton) but I had to miss it due to surgery. She did it herself and did well (sub 4hrs). We have re-entered again this year and the plan was to do it together, but it is clear from training rides we have different approaches. She wants to pootle again and stop for snacks and rests. I want to hammer it as best I can, eat on the wheel etc. We went for a mountain bike ride together last week and she just kept wanting to stop to check directions, eat, drink etc. I was cold and irritable because we were stopping every 10 minutes. She just said she wanted to do the L2B on her own so she didn't feel pressure to stick to my pace. We are just generally not in a great place this week for a few reasons but she seems extra annoyed with me at the moment. AITA? Should I just relax and ride slow with her?",
    "post_title":"AITA for wanting to ride at a different pace to my wife?",
    "verdict":"YTA"
  },
  {
    "post_id":"110tvop",
    "post_content":"To give a little context me and my gf were driving and to make the time pass quicker we were playing spelling bee. She would say a word and I would spell it out. After some time back and forth, we switched to me asking her how to do some maths questions. Namely calculating the price after a percentage discount has been applied. After a few questions, I noticed that she was counting on her fingers to help her solve those questions that me seemed easy and I can do that in my head.  Now I have no problem with her using whatever method to work out the answer, however while she was counting on her fingers I said “it would be embarrassing if you did that in the office”. After that it was silence in the car and some arguing. I don’t feel like what I said is wrong, as I wasn’t making fun of her for counting on her fingers, I was just stating that in an office environment counting on your fingers would be embarrassing.<br/>AITA?",
    "post_title":"AITA for saying counting on your fingers in the office would be embarrassing",
    "verdict":"YTA"
  },
  {
    "post_id":"10wg500",
    "post_content":"My gf (20f) and I (19f) were having a casual conversation where we were discussing different pets she had throughout her childhood. She then told me about a pet that passed away. She asked whether I knew what a axolotl was. I had no idea so she showed me pictures from google. I was shocked and said that it looked like a demon and something out of stranger things. She did not appreciate it. She then said that Ditto (her axolotl) was a sweet animal but she had to feed her live earthworms. I was even more disgusted and continued to say she looked like a demon. AITA?",
    "post_title":"AITA for making fun of my gf's dead pet?",
    "verdict":"YTA"
  },
  {
    "post_id":"11057nl",
    "post_content":"Last night after going out with her friends, my (20m) girlfriend (20f) called me asking if I could come pick her up because she was too drunk. Since I was already there she asked me if I could give her friends a ride home too. I thought it was only fair if they reimburse me for gas money because it was a far ride there, back, and to each of their homes. So the next day when she was sober, I asked my girlfriend if she could ask her friends to pay me. My girlfriend got upset with me, and said I shouldn’t expect them to reimburse me because driving them home was the right thing to do. Yes it was the right thing to do, but gas is expensive and if I wasn’t there they would’ve just paid for Ubers anyways. So why can’t they pay me. AITA?",
    "post_title":"AITA for asking my girlfriend to ask her friends to pay me for driving them home",
    "verdict":"YTA"
  },
  {
    "post_id":"10vwlu4",
    "post_content":"I'm 27F. The guys in my group often post \"funny\" videos about women saying \"stupid stuffs\" then they'll insult the woman in the video, calling them dumb etc. They never post any \"funny\" videos about men, only women.<br/>When I see that I somehow get irritated. I can't really explain how or why.. I usually get irritated the most when a girl there also say things like \"stupid bitch\" to the woman in the video. I keep wondering \"You're also a woman, why would you do that\"But when I say my opinion, they'll dismiss me. They said that I'm too overly sensitive.<br/>Am I the asshole here that I get irritated?",
    "post_title":"AITA for getting annoyed at guys making fun of girls on a video",
    "verdict":"NTA"
  },
  {
    "post_id":"10t9d4d",
    "post_content":"My husband is a horrible gift giver. It's gotten to the point that I dread my birthday because I know I am going to be let down. This Christmas was the final straw for me. I got him a bunch of things that were personal that I knew he would like. He got me a tray for the microwave so I could heat up our two kids plates at the same time and a book about horrible mom's (I had a baby two months prior). It felt like such a slap in the face. I gave him ideas (sent him links to three rainboot options, tickets to a show I want to see, massage, even chapstick), but nope, bad mom and something for the kids (half his gifts to me now are gifts for the kids). It's not a money thing, just a show you care about me thing, not that you found something on prime. WIBTA if I said no more gifts between us?",
    "post_title":"WIBTA if I told my husband that we should stop trading gifts?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vusar",
    "post_content":"I am a 16 year old male who enjoys playing games. My father hates them with a burning passion, last night I was playing and he told me to get off, I said sure and told him I would get off after this game, he said ok and left my room. I came out five minutes later after I finished my game, he then proceeds to tell me he was about done with my \"fucking video games\" and said I had been on for 5 hours, I told him it was only 2 hours and showed him my play time to prove it. He then called me \"fucking psychotic\" and said I couldn't play for a week. Am I in the wrong?",
    "post_title":"AITA for playing video games",
    "verdict":"NTA"
  },
  {
    "post_id":"10teo5i",
    "post_content":"I was at a friend's house with some others for a party and we were playing truth or dare. I only knew one person, and everyone else was their friend. My friend (let's give them a name: Alissa) started first, saying 'Is it true you don't brush your teeth? Cuz my my it is as yellow as the sun!' too a poor girl who already took a lot of persuasion to even be there in the first place.<br/>Alissa started laughing at the girl who's cheeks turned cherry red. I then told her to stop being rude, and she said that she's a sadist and she can't help it. I personally believe that she tends to take stuff too far and doesn't notice when others actually feel hurt.<br/>She told me that I was being a 'party pooper' and ruining all the fun. I tried to comfort the girl that was literally crying Niagara Falls, but then I got kicked out.<br/>Am I the asshole?",
    "post_title":"AITA For telling someone to stop being rude?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vw26j",
    "post_content":"I (27F) work for a fast-casual restaurant. It's not out of the ordinary for me to sometimes get there early so I can eat something. Today was one of those days, as I had spent most of the day sleeping and thus didn't eat much. I was really craving a milkshake and a burger from my restaurant, especially since I get a 50% off discount. My coworker (40F) was already on the line, since I am her relief. I arrived 30 minutes before my shift and boy, were they busy, which is odd for a Monday. Coworker saw I had ordered something and was waiting at the bar; she immediately got pissed and asked why I didn't clock in early since she had clocked in early yesterday. I may be the AH for not returning the favor, but I don't have to clock in early if I don't want to, and I was there to eat while I still had the chance. Getting to eat while on the line is very hard since there's so much prep to do and I'm the only night cook. So, Reddit, AITA?",
    "post_title":"AITA for not clocking in early?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vo2fu",
    "post_content":"I 25F am the only one providing in our house. My partner 30M is not working atm. (Not due to medical issues) . We are far from being well off. We are late for rent every month since he lost his last job and live paycheck to paycheck on my 2k a month income. However he insists I get every grocery item he wants. Now if we had dual income like we should I would, however like I said we don't have money like that. He insists I get every thing he asks for cause he is the one that cooks. I keep trying to explain that I'm struggling and if he doesn't want to get a job he needs to stop demanding so much from me as I'm doing the best I possibly can. He says I'm selfish and a (b word) for not getting what he \"needs\" to cook. Am I the asshole for not getting all the groceries he requests?",
    "post_title":"AITA for not getting all the groceries my partner asks for?",
    "verdict":"NTA"
  },
  {
    "post_id":"10y2f40",
    "post_content":"My husband suffers with heavy depression and lack of friends. Few months ago I saw a notification of a reddit post of something like \"female looking for friends\". Well he cheated me in the past and I found out in a similar way, so call me disrespectful, but I found his profile and went through his comments history. I saw a lot of comments on reddit posts of girls looking for friends, people to chat with, stuff like that. I decided to come clean and talked to him about it, said I was uncomfortable especially because he only answered posts of girls looking for friends (he is a straight male). He was extremely upset, said he was only trying to make friends and that he gets along better with girls, but agreed to stop. Well he is back at it again. I felt bad in the past for asking him to stop, specially because it shows a lack of trust... So, the question is, AITA for asking him to stop?",
    "post_title":"AITA for telling my husband to stop looking for female friends online?",
    "verdict":"NTA"
  },
  {
    "post_id":"110v1fr",
    "post_content":"My friend (51 F) says she's diagnosed with EDS. I offered to help her with her yard at her house, and I noticed she was asleep for most of the day. When she woke up I asked her why she wasn't helping me do some of the work and she said she still feels tired. I said ''how can you feel tired when you sleep all day?'' she told me ''because I have EDS'' and I told her my son has EDS and he works in a prison every day of the week. He sleeps 8 hours each night and works for the entire day no problem. I told her she's not putting in any effort and she's being lazy. She began to get upset and emotional and I'd had enough so I left. AITA here?",
    "post_title":"AITA for questioning my friend's EDS",
    "verdict":"YTA"
  },
  {
    "post_id":"110mqtm",
    "post_content":"I have a 13 years old daughter with my ex wife. She also has 2 more kids who I think are 11 and 8.My daughter hates taking the bus to school because it takes longer and isn't much comfortable. This year my work schedule changed so now I'm free to take her to school and bring her back. We usually get breakfast on our way to school or we spend some time afterwards.<br/>My ex asked me to give her other kids a ride as well. She thinks I should do this because her older kid goes to the same school as my daughter and her younger kid's school is on my way. She says her kids get jealous when they see their sister doesn't have to take the bus which takes about an hour longer to get to home or school.<br/>I told her I will not do it because her kids are not my responsibility and she thinks I'm an asshole",
    "post_title":"AITA for not giving my ex wife's kids a ride?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uo7ec",
    "post_content":"Hello people of redditMy cousins dad and my aunt have recently gotten an divorce. And i was wondering wibta if i unfriend him on various platforms as he does alot of post that are annoying to look at. The thing is i think my counssin could get quaigt (how the f do you spell that) angry at me for it so pls help what should i do",
    "post_title":"WIBTA if i unfriend my cousins dad",
    "verdict":"NTA"
  },
  {
    "post_id":"10wg59w",
    "post_content":"My manager is retiring. The job listing for his position is on the HR \"Job Listings\" page. I'm sure it's on Indeed or ZipRecruiter as well.  I'd like to take the position. The company has to make the job listing public for a certain amount of time for whatever legal reasons. My manager thinks I'll be great for the job. Here's my moral\/ethical problem: Whoever posted the job on the HR site did a bad job of it. The position I want has no title. The first paragraph is left over from a different position we've already filled. The jump button at the top of the page that lists the different departments does not jump for my division. I could point all this out, but that might mean that someone scanning the page would have a better chance of finding it. It might be the person who is best suited to take the position, who would be better for the company.<br/>AITH for keeping my mouth shut?",
    "post_title":"AITA for not pointing out the mangled job listing on my employer's website because I want the job?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uqbli",
    "post_content":"Some background, I 20F have three younger step siblings F18 M17 and F12. We have never gotten along and I especially can’t stand my step brother M17. Went on a family vacation and had two joined rooms. I walked in my room and he was sitting on my bed I was immediately hit by a vile stench that was filling the room. I said “something smells awful” and he immediately said it must be his dog (a 6 pound chihuahua). I knew it wasn’t the dog because he was visibly dirty so I picked the dog up smelled it and told him that it was definitely him. He argued and said it wasn’t and it was none of my business. That may be true but in my opinion if I am sharing a room with him it becomes my business. I told him that he was making it everyone else’s problem because he was so dirty that he was making the room reek. My parents are pissed and possibly rightfully so because I wasn’t kind in any way.",
    "post_title":"AITA for telling my step brother he’s disgusting for not showering?",
    "verdict":"NTA"
  },
  {
    "post_id":"110bqvg",
    "post_content":"i was living with my brother. his girlfriend moved in a couple of years ago. together they have just bought a house and i'm staying with them for the time being.<br/>now, at the apartment her mom would stop by once a week for an hour or so. no big deal. since we've moved into the house her mom has been here every day for long periods. even so far as to leave and come back on some days.<br/>i don't dislike the woman. we chit chat and so on. but i don't want another person just showing up every day. i brought it up to the girlfriend today. she seemed kinda pissed but said it was a new house kinda thing but i've got a bad feeling that if i don't wrangle this now it's gonna get out of hand. am i a dick?<br/>edit: i'm not staying rent free. we're all paying 1\/3rd. it's exactly the same arrangement as we had before except instead of her living in mine and my brother's apartment i'm living in their house. ",
    "post_title":"AITA if i don't want my brother's girlfriend's mom over all the time?",
    "verdict":"YTA"
  },
  {
    "post_id":"10uyuz3",
    "post_content":"My boyfriend was watching Shameless by himself for 4 seasons of the show. I joined him occasionally in watching the show but really got hooked. We are long distance and both work full-time. Sometimes we watch TV for 30 minutes at night together, and we started watching the show together at some point. So we were on the same episode, and my boyfriend wanted to be loyal and stopped watching the show without me. I continued watching it on my own, and now he thinks I’m TA. So people of Reddit, AITA?",
    "post_title":"AITA for watching TV without my boyfriend",
    "verdict":"YTA"
  },
  {
    "post_id":"10uxp1w",
    "post_content":"When I was in high school I played in the orchestra and the bassoon player who was a friend of mine was gay. I personally didn't care about that at all, but I couldn't help but find it funny because a lot of the sheet music we had was in Italian or German. It just so happens that the word of bassoon in Italian is \"fagotto\" and in German it is \"fagott\" (and yes, both words mean exactly what they sound like), I assume it is because the instrument sort of resembles a bundle of sticks. My friends (the bassoon player included) all laughed about it at the time, but I can see how people today might see it as homophobic.",
    "post_title":"AITA for Laughing at the Fact that the Bassoon Player in my Orchestra was Gay",
    "verdict":"YTA"
  },
  {
    "post_id":"10yes0g",
    "post_content":"Ok so I have a fest in my college on the first weekend of March and my long-distance girlfriend wants me to come over on that particular weekend. I could come a weekend later or prior but she wants me to come on that specific weekend. She wants me to \"choose\" between a fest and her. Of course, I would choose her but if I can meet her a week prior or later and attend the fest then why not ? I tried to explain this to her but she says she is feeling like she is begging for my attention.",
    "post_title":"AITA for not meeting my long-distance girlfriend for a specific weekend?",
    "verdict":"NTA"
  },
  {
    "post_id":"10xoph7",
    "post_content":"I (36f) am getting married to G (40m) our wedding is coming up in 9 months (We have been dating for 24 months) and I am having 6 brides maids my friends and my sister. However when I told G and future stepdaughter (16f I have known future step daughter for 18 months but we have never really got on well even though I have done girls weekends with her and stuff like that) they asked me why she wasn’t a bridesmaid. I told her that I planned on having six and only having my oldest friends who I have known since I was 5 and my sister. She got really angry at this and G took her side saying that it would help me bond with her and so on. I told some friends what happened and they agree with G. AITA?<br/>Edit: A lot of people have been saying she should be on the wedding party and she, is with our parents.",
    "post_title":"AITA for refusing to have my future step daughter as my bridesmaid?",
    "verdict":"NTA"
  },
  {
    "post_id":"10tooib",
    "post_content":"My wife wants to go to a nice dinner. I agreed to it. However, she wants to go above and beyond and wants me to wear a suit. I Hate wearing suits, but I told her I’d do it if she wears a nice dress. Now, I didn’t say it; but it’s obvious that she would need to buy a new dress. I even offered to pay for it. Apparently this isn’t fair because she didn’t like the idea because a dress type I suggested would be more than what she’s comfortable wearing. She did however used to wear this type a couple years ago. Aita?<br/>Edit: I’m going to cancel our plans. Looks like we’re at an impasse. Thanks for chiming in.",
    "post_title":"AITA for telling my wife I would wear a suit to dinner if she wears a nice dress?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z44qf",
    "post_content":"For context, my partner and I live an hour apart so we don’t get to see each other often. Today I asked my partner to do something special for me for Valentines. I said I don’t want anything specific I just want him to do something nice for me and he suggested a picnic. Thing is, I have a concert the night of Valentines day and asked him if we can do the picnic another day, maybe even the day before or after. He said no because he has school and was only going to skip school if we went on Valentines Day. I then suggested we can hangout before the show since he seemed so adamant about having our plans the day of. He told me that I would rather go to a show than spend Valentines Day with him and was upset because I recently brought up about how we don’t get to spend much time together since he’s so busy with school and work.",
    "post_title":"AITA for asking my partner to adjust our Valentines day plans?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z9zc5",
    "post_content":"My parents gifted money for my wedding and reception. My fianceé and I decided that we wanted to do a private ceremony a few months before public vows and a reception. My family is upset with this decision and has asked that we cancel our public wedding\/reception and return the money gifted. They said they don't care if we give back amounts already paid to vendors. We have chosen to continue with our plan to host a public event. AITA?",
    "post_title":"AITA for not returning a gift of money?",
    "verdict":"YTA"
  },
  {
    "post_id":"10v0goc",
    "post_content":"My wife and I ran into our coworker earlier today. He has never met her. I introduced her to him. He jokes around often and when i introduced them to each other he said “ I thought Alexis was your wife.” She’s a coworker. Him and I laughed, but not my wife. He noticed because he got serious and said “I’m kidding, nice to meet you.” After we got home my wife asked me who Alexis was. I told her she’s a coworker. She then asked me “so, what’s that all about?” I told her if she’s serious and it was clearly a joke, to lighten up a little. That didn’t help, she said to never laugh at things like that. I thought it was a harmless joke. Needless to say, she wasn’t happy still when I left. Aita?",
    "post_title":"AITA for telling my wife to lighten up over a cheating joke my coworker made?",
    "verdict":"YTA"
  },
  {
    "post_id":"10x4t3v",
    "post_content":"My sister's taken to adopting a very Brain Dead Stoner Surfer Dude way of speakingInstead of saying hello she says \"Sup?\"Goodbye is \"Latz\" or \"Later Much\"Things she doesn't like are \"harsh\" or \"a beat scene\" Suspicious things are \"bogus\" or \"sketch\"Unique things are \"spesh\"Good things are \"sweet\" or \"radical\" or \"the tits\" (I especially don't like that last one)\"Chaka brah, gnarly, tasty, rando, ferosh, bitchin', tweaked...\"Some of this stuff I don't even know what it means.<br/>I've asked her politely a few times to stop. Told her it really, really annoys me.  She laughed and seemed to do it *more.* I finally said \"If you can't talk to me using plain English, please just don't talk to me at all until you can.\" To which she replied \"Harsh, dude.\" Now we literally are not speaking.<br/>AITA for laying down a \"language boundary?\"",
    "post_title":"AITA for asking my sister to please not address me in \"dudespeak?\"",
    "verdict":"YTA"
  },
  {
    "post_id":"10vjjxx",
    "post_content":"I (20M) have decided I want to purchase a tarantula as a pet for some companionship during my times at college. I live in an apartment with 4 other guys (all of us have private bedrooms) and 3 of them are fine with me getting a tarantula, but the other one... not so much. He claims that the presence of a tarantula in the apartment would freak him out, and even though it would be in my own private room (and he would never have to see it), I am NOT allowed to get one. We are already getting some pet frogs and he loves that idea, but he will not allow me to get my own tarantula. AITA for getting one anyways?<br/>edit: I haven’t gotten the tarantula yet",
    "post_title":"AITA for getting a pet tarantula when my roommate has already said no",
    "verdict":"YTA"
  },
  {
    "post_id":"10wr18t",
    "post_content":"AITA for giving all my money?I have this kind of feeling to help people especially old people who don't have any resources. Now I don't have money left til I got my pay on friday. I think I can endure hunger for a few days. I just feel good when I help someone in need.",
    "post_title":"AITA for giving my only money 60$ to an old man asking donation on the street.",
    "verdict":"YTA"
  },
  {
    "post_id":"10w5ydi",
    "post_content":"I 25(F) have a friend(26M) whom I met via a game. We started playing together a lot and he lives in the same city as I do. He once asked me out and I politely declined and asked him if we can still continue to be gaming buddies and I agreed. He once made an inappropriate butt joke and i told him that I didnt like such jokes and said he would stop. Yesterday he made another inappropriate joke and I told him if he keeps making me uncomfortable like this I would stop playing with him altogether . He called me an AH for not being able to take a joke.",
    "post_title":"AITA for asking my gaming friend to not make inappropriate comments\/jokes?",
    "verdict":"NTA"
  },
  {
    "post_id":"10w9tc9",
    "post_content":"Throwaway accHi there, I just wanted to get some opinions here: My bf just showed me what he ordered for valentine's day. It's a black Teddy bear statue made out of plastic roses. It's kinda cute but he knows that I don't like useless gifts or clutter that just takes up space. I know it sounds really ungrateful. But it's just a waste of money (60€) in my eyes and space for something I won't like. :( He doesn't even have to buy me something. I just don't want any more useless stuff laying around...Should I keep it to myself and slowly move it to a place where it won't get in my peripheral vision or should I say that he should get a refund?<br/>Edit: as I'm getting a lot of \"should've told him beforehand that I don't like that kind of present\" Already did that *twice* for christmas and my bday",
    "post_title":"WIBTA if I asked my boyfriend to cancel his order for my valentines day gift",
    "verdict":"NTA"
  },
  {
    "post_id":"10y6brp",
    "post_content":"We have the biggest orchestra concert coming up we will have had probably 11 rehearsals to prepare. I’ve missed 3 due to car trouble or illness. I also have a degree recital coming up. Most of the time we are taken out of the rotation to alleviate the stress and focus on our recital. My section and director are upset and don’t feel like I’ll be prepared for the concert. Is it fair when they were awarded time away from orchestra to get ready for their degree recitals and have school affiliated jobs that work around their schedule flexibly when my work also does not amidst doing a recital in a similar amount of time? I feel like a jerk, while feeling like I maybe shouldn’t. They have school jobs and a strong support system whereas I have to work a serving job that doesn’t necessary observe my requests for time off and I also have to work a lot to pay my bills. Making it hard to “show up” sometimes.",
    "post_title":"AITA For missing some rehearsals?",
    "verdict":"YTA"
  },
  {
    "post_id":"10ygy5y",
    "post_content":"My father is in a state pchyc hospital. he has bi polar 1.  he gets manic angry and asullted aneighbor, dont care why its assallt.   He is being evicted for the behavior.  Refuses to recognize.  I ask because he has animals that even in a better state didnt care well for.  I need to rehome them for them to survive. i found great could not be better placement.  My father said NO i read its illegal to rehome and or send to a shelter animals that arent yours.  they are property.  you can be held liable for stealing and also sued for emot damage.&amp;#x200B;Should i do it anway to save pet lives?  he has let birds die b4 to make a point they are his not mine.",
    "post_title":"AITA my dad in an institution, getting evicted, and wont permiss my rehoming but i will anyway",
    "verdict":"NTA"
  },
  {
    "post_id":"10z47ni",
    "post_content":"So where I work, there has been a homeless couple living in a car in our parking lot for several months. The car doesn't belong to them, had a smashed in window, and was from out-of-state. We never bothered them, until over the course of a few weeks, they came in, drank hand sanitizer, and started asking customers for money. The final straw was when the woman also told one of my (male) employees that he owed her child support. After that, I called the police about it, who said the car wasn't reported stolen, so there was nothing they could do. I called a tow company, who came and took the car, kicked them out, and had them grab all of their stuff. Now I can see them walking around aimlessly without anywhere to go and I feel so guilty. So, AITA for towing an abandoned car that some people were living in?",
    "post_title":"AITA for towing a homeless person's \"borrowed\" car?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uwc38",
    "post_content":"AITA for thinking that a parent drinking 16 beers in an 8 hour period is too much when you have 4 kids in your care? One of these kids includes a newborn baby. I am the other parent and I was there and not drinking but am I wrong for thinking this is inappropriate for the other parent? It seems excessive to me. He insists he is not hurting anyone and it is not a problem. And that basically I shouldn't have an issue with it.",
    "post_title":"AITA for criticising a parent for drinking 16 beers in an 8 hour period, with children in his care?",
    "verdict":"NTA"
  },
  {
    "post_id":"10yheiw",
    "post_content":"I feel bad. So my brother and I both live with our parents (we’re both in college, he has a break and i have an internship) anyways my bed is right above the Laundry room and the noise is awful. I heard the laundry starting at 12:15am yesterday and went down and turned it off. Then I heard it back on again, I went out of my room and my brother said he needs to dry his clothing. I told him it 12:30am and it’s late and I turned it off. However I feel really bad now and wonder if I should just have let him use it. He said he needs to dry his clothing but I was like “you had all day. I was annoyed since I have my internship to go to and need to sleep but I also feel bad for him.  AITA?1) what action you took that should be judged: I turned off the dryer that still had all this clothing in that were fully wet and those were all his main clothing 2) why that action might make you the asshole: should I have just let it slide and let the dryer run and waited it out, did I react too harshly",
    "post_title":"AITA for turning off the laundry at 12:30am?",
    "verdict":"NTA"
  },
  {
    "post_id":"10v3gku",
    "post_content":"My girlfriend and I have been together for a few months now and we met at our workplace. She always came by bike because she couldn't afford to buy a car for herself. I decided to pick her up from home and to work with my car and said to her if she wanted to she could look for a car and pay me back whatever it costs. She agreed and found a car she liked and made a deal to look at the car and buy it the same day (all of this within a span of a few days after telling her this). No problem but a few days before she would've went to look for the car, I got some serious bills to pay which made me unable to pay for her car now. I told her this and she was fuming, calling me a liar and said that I wasn't a man of my word. I know she had abusive boyfriends in the past which maybe explains her extreme outburst but I still have the question in my mind: Am I the Asshole?",
    "post_title":"AITA for promising to buy my girlfriend a new car but having to cancel it because of unexpected financial bills?",
    "verdict":"NTA"
  },
  {
    "post_id":"10ygrm2",
    "post_content":"my (M15) friend (F17) was on a call with a few friends. Her boyfriend happened to be in the call with us. For privacy reasons we will him, Red. I have been in calls with them before along with my friend, Chad (M14). We are all friends. Today, I realized Red sounded awfully familiar. After a few hours of being on call, it finally clicked and I realized he sounded like the YouTube Dream. Of course that was too funny to keep to myself. I told him on the call which he immediately refused. However, my friend Chad agreed. We went back and fourth with Red disagreeing and Chad and I laughing. Every word he said, sounded more similar to Dream. This went back and fourth for several minutes. I assumed it was all giggles. I couldn’t stop laughing until tears started building up in my eyes. Eventually, the girlfriend left the call, saying she was uncomfortable. Now, I thought it was still jokes and Chad and I giggled on call for several minutes. However neither of them are responding. So AITA?",
    "post_title":"AITA for saying my friends boyfriend sounds like Dream.",
    "verdict":"YTA"
  },
  {
    "post_id":"10wnymz",
    "post_content":"We split the rent, utilities, food, etc. SO turns on the space heater at full power an hour before leaving for an early flight and forgets to turn it off. 8 days later, we come home to a sweltering apartment that fortunately didn't burn down in our absence. I say \"Hey, that was dumb, but shit happens. Let's move on. Though I'd appreciate it if you cover the electricity cost for the time we were away.\" SO does not agree. Tension ensues.",
    "post_title":"AITA for suggesting my SO cover the electricity costs for leaving a space heater running for a whole week?",
    "verdict":"NTA"
  },
  {
    "post_id":"10tvhja",
    "post_content":"My friend invited himself over to watch a show together, saying he'd bring pizza. In the past he's come over with pizza, given myself and my girlfriend each a slice, then eaten THE ENTIRE REST OF THE PIZZA. Ya, sure, it's his, but when I offer him food I always expect he'll eat a full portion and he always does if not more. So I reminded him if he's going to bring pizza that he needs to bring enough for everyone to have an equal share, and he says I'm being unreasonable. AITA? I have no problem providing other snacks to share, but I wouldn't be impressed if again he eats almost the entire pizza himself.",
    "post_title":"AITA For Insisting My Friend Bring Food For Everyone?",
    "verdict":"NTA"
  },
  {
    "post_id":"10yvfm2",
    "post_content":"So basically Me and my mom have had a few fights because of my “behaviour” (my mom is the type of person that completely snaps when she hears me or my sister calling eachother dumb and thinks it’s a very bad insult) and I’m sick of it honestly since I don’t view what I’m doing as horrible and disrespectful.<br/>I’ve also gotten into the gym the last month and a half and I Love it.(I’m not in good shape and I want to better myself) But all of a sudden to find a way to annoy me instead of taking my phone or whatever she doesn’t allow me to go to the gym.<br/>Am I the only one who thinks this is completely and utterly stupid way of punishing someone??Im thinking of going anyways and ignoring her but I need to know if it’s a good idea or if I’m the a hole in this situation",
    "post_title":"AITAH for wanting to go to the gym?",
    "verdict":"NTA"
  },
  {
    "post_id":"10veddy",
    "post_content":"So let’s begin it was my friends party let’s call her tia so at tias party we all got a bit drunk and when I get drunk all my emotions start to come out I start crying about my dad because he passed away this always happens when I get drunk my other friends let’s call her Beth and kent (I’m not good at making names sorry) told me to stop or go home so I stopped and I kept getting drunk it turn out fun in the end but then Beth and Kent walk me home and was telling me how i ruined the party because I cried I got home and they started texting me saying don’t speak to them I ruined everything but they was also having a go at my other friend for being sick I don’t know if I deserved all these text because after we had a lot of fun and me and the tia and a bunch of other girls were taking pictures in her room she didn’t say anything about me crying at all  Am I the asshole",
    "post_title":"AITA for crying at my friends party",
    "verdict":"YTA"
  },
  {
    "post_id":"10xhobo",
    "post_content":"I’m supposed to attend a wedding in Asia (14 hour flight) next week. It’s my girlfriends best friend- she’s the maid of honor. My elderly father unexpectedly needs to have heart surgery while I’ll be away and I don’t feel comfortable leaving him. AITA for dropping out and asking my GF to go alone? She doesn’t feel totally comfortable traveling alone- and has hinted she would be embarrassed to be there alone not as a couple",
    "post_title":"AITA- Can’t attend destination wedding with girlfriend, elderly father needs surgery",
    "verdict":"NTA"
  },
  {
    "post_id":"10vd6jy",
    "post_content":"So my (19m) parents speak Spanish because their parents were born in Mexico and they want me to learn Spanish along with their family who wants me to learn. People give me so much backlash for not being able to speak Spanish but to them I look Mexican. I feel like that backlash will never go away since I will still have an accent even if I become fluent so what’s the point? They expect you to speak perfect Spanish and perfect English and I just can’t do that. Having an American accent will just make me more of a no sabo kid and be more embarrassing than if I just don’t know Spanish at all.",
    "post_title":"AITA for not wanting to learn my parent’s language because I’ll have an accent?",
    "verdict":"YTA"
  },
  {
    "post_id":"10wv0pu",
    "post_content":"Long story short, my wife’s parents immigrated here from another country and most of her extended family still lives in said country- I haven’t met most of them yet. We are planning to visit this country and she was telling me about her relatives there. I asked if she had any living grandparents to which she nervous laughed and said that if she did have any, I would probably know about it. She went silent and about five minutes later, said that she found it super concerning that she has spoken many times about how her grandparents on both sides have passed… and that I would not remember and still ask her this question. That she’s extremely alarmed that I haven’t listened to anything shes shared about herself over the years. It know was completely dumb of me but it was also an innocent question. I hate that it’s making her paranoid that I don’t care about her background but I also feel scolded. So, AITA?",
    "post_title":"AITA for asking my wife of two years if she has any living grandparents (forgot that she doesn’t)?",
    "verdict":"YTA"
  },
  {
    "post_id":"10uygx6",
    "post_content":"Me (19m) have been dating my gf (19f) for 8 months. At the beginning of our relationship it was going amazing, with everything being normal and we were both happy. A few months into our relationship I noticed that she would sometimes compare me to her BIL. I didn’t mind at first until she started to do it way more often, which made me very uncomfortable. She often says that he’s super handsome, and the sweetest person she has ever met. (While saying I should be more like him.) Also every time he is around, she just completely ignores me and plays it off as if she doesn’t hear me when I try to speak to her. I’ve confronted her about how uncomfortable I am with her comparing him to me, but she thinks I’m overreacting and just being an asshole for confronting her about it. AITA?",
    "post_title":"AITA for being uncomfortable that my gf (19f) is “obsessed” with her BIL (20m)?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vqkvl",
    "post_content":"Background. Both my husband and I are penny pinchers. He does a better job at pinching, so naturally I'm the spender of our relationship. On our trip. I saw some really nice leather wallets that I wanted to get him because his is about 2 years old and threads are already coming off. When he noticed what I was doing. He kept telling me he doesn't need it and it's too bulky.  Finally, he stormed out of the store when I went to pay for the wallet. The wallet was $60. He usually spends about $20. We are not rich. But we are not poor either. We can afford a few trips out of the country every year. When we got back to the car. He continues to throw a temper tantrum saying that I was an AH and did not respect his wishes. I got fed up and said. When someone buys you a gift, you're supposed to thank them. AITA?",
    "post_title":"AITA for buying a present for my husband",
    "verdict":"YTA"
  },
  {
    "post_id":"10x9liv",
    "post_content":"I recently went to visit a friend this winter. She lives in a big city and I live in a small town.<br/>Her one bedroom was pretty cramped and had half of it set up for work, and half for living. I also noticed she had trouble finding community and I told her she can't heal without community.<br/>She eventually exploded and said her house costs $3000 a month (compared to my $700) and she's exhausted.<br/>I also said she should finish decorating and again she was mad because she just bought her apartment and things are expensive.<br/>She told me she was annoyed because she's black and I'm white, and that my family is quite rich while she is trying hard to build her wealth. She said her and I have had completely different life experiences I didn't mean my comments and I don't think I was an AH.<br/>So reddit, AITA?",
    "post_title":"AITA for saying \"you need more friends\"?",
    "verdict":"YTA"
  },
  {
    "post_id":"1106axc",
    "post_content":"We got in a car accident today and my car is totaled. Ot was 100% my husbands fault. It was a fully paid off Nissan Rogue that was in good condition and should have lasted a few more years. But it is 9 years old and had over 100,000 miles on it so we will probably only get $4-5000 for it from the insurance, if that.  So I am upset. I am a pet sitter and go to people's houses for work and need to have a reliable vehicle. But when I show emotion (mind you it happened today) he gets mad at me saying I already feel bad, you don't need to make it worse. So AITA for being upset about losing my reliable car and either taking on debt I can't afford to get a new one or ending up with something much less reliable?",
    "post_title":"AITA for being upswt when my husband totaled my car?",
    "verdict":"NTA"
  },
  {
    "post_id":"10zfsq7",
    "post_content":"I play FFXIV and I am a normal human dude. I joined an FC (a guild) to try and broaden my horizons and do activities. It was actually full of darker-skinned characters like inhumanly silver, grey, and humanly black and brown colors. I thought nothing of it, but I did find the skin colors very ugly because video games make lighter-skinned characters way more appealing than darker-skinned ones. So for the asshole incident, one of the FC members asked for our opinion on her outfit in the game. It was a picture of her very dark female lizard race, and I just commented, \"I would like it better if your character had lighter skin.\"All hell broke loose and this led to me being accused of being prejudiced and biased. But I'm not, it's just my opinion. AITA?",
    "post_title":"AITA for how I talk about MMORPG skin color?",
    "verdict":"YTA"
  },
  {
    "post_id":"10w7rco",
    "post_content":"So my mums dryer  hasn't been working properly for a while now,  yesterday I was told this guy would come around to fix it around 7 to 11am now my whole family was gone by 8.30 maybe 9 ish ,I figured setting my alarm to 9 am would be enough , nope this guy shows up at 8.50 am ten minutes later I would of been up and ten mins before my family would if been home but no , he didn't call my mum untill after he said he was leaving,  if mum had called me because he needed in I would of  woken up but he didn't and now my mum is mad at me for bit being up and us needing  to reschedule the appinment aita for ni t being awake ?<br/>IMPORTANT EDIT: I wasn't aware of the time he could show up I was just told he would show up before 11 , that is how I thought this conversation went but my mother's swaers she said 7 to 11 so I don't know if  my brain is just blocking that out",
    "post_title":"AITA because I wasn't awake when they handyman showed up?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z6jbo",
    "post_content":"So.... I'm working overtime 6 days a week already, My 18 year old daughter wants a ride right after work, and I'm so tired don't even get out of the car. Please keep in mind,  I  walk over 16k steps a day.😡 Surface Mount Technology ( google it)Coming up, I'm working 20 days straight where I have to get up at 3am on the weekends but yet still have to drop her off at 4pm ( Right when I get home during the week) then pick her up at like 10pm.... I'm about DONE. She has a job and makes her own money....AITAH For for saying.... UBER ##$$##$",
    "post_title":"AITA For not wanting to be a personal Uber to my kid when I'm working 20 days straight",
    "verdict":"NTA"
  },
  {
    "post_id":"10u0dsx",
    "post_content":"I (F49) have three daughters, Maggie (F20), Miranda (F18) and Michelle (F15). My eldest moved out last year to transfer to a different college farther from home, about a 6 hour drive. We have an old house (it was built in the 1910s) and I needed some renovations done in my office because of some issues with the wiring, so I moved Maggie’s stuff to the basement and put my office things in there.<br/>Well, Maggie came home unexpectedly this weekend and was kind of upset that I moved her stuff. She said I’d said I’d leave her room alone and that she might want to stop by unexpectedly to make sure everything’s okay and to see us. I told her it was temporary and that it wasn’t that big of a deal. Maggie told me it was ‘whatever’ and went to sleep on the floor in Miranda’s room. Miranda told me she seemed upset.<br/>I think she’s being dramatic, but I’ve been told I can be rude, even when I’m not trying to be, so maybe it’s my fault. AITA?",
    "post_title":"AITA for moving all of my daughter’s stuff into the basement?",
    "verdict":"YTA"
  },
  {
    "post_id":"110gin2",
    "post_content":"So my partner and his eldest daughter were playing the new Harry Potter game upstairs in the bedroom, I don’t mind this what so ever and I enjoy helping them play too. We did it the night before last too. But he’s mad at me because I was really tired last night and wanted an earlier night at 10pm so I said I want to go to bed now and he’s been mad at me all day today. The night before I asked them to turn it off around 11 or 11.30 I can’t remember and that was fine. He always goes to bed very late around 3am anyway. Apparently I’m in the wrong as I wanted the PlayStation in our room so we could all play together but I shouldn’t be allowed to boot them out when I want to go to bed and that I should go sleep in one of our children’s rooms (I have a 4year old and a 7year old with him too). Apparently he’s going to take the PlayStation downstairs today into the living room so they can play it later into the night which I’m fine with too. AITA?",
    "post_title":"AITA for booting out my partner and his eldest daughter",
    "verdict":"YTA"
  },
  {
    "post_id":"10zwsyz",
    "post_content":"My husband and I have a dog and he’s pretty well behaved and trained. He’s going through puberty and has some small issues we need to work on. When he sees another dog he will lunge and bark and try to go play, and when people come over he jumps up at them.  We have done all sorts of different training approaches, but my husband got a shock collar. He set it up today and wanted me to feel the shock. I didn’t want to be shocked. He said if I’m not willing to shock myself then I can’t shock the dog. I said ok, I won’t shock the dog then. But, he continued to be upset that I absolutely refused to be shocked by the shock collar. I told him I don’t jump up on people and don’t need to be shocked and if he feels it’s a necessity to be shocked to give a shock then I won’t. I have been tazed before so I am positive I don’t like electric currents through my body. AITA for refusing to be shocked?",
    "post_title":"AITA for not wanting to be shocked?",
    "verdict":"NTA"
  },
  {
    "post_id":"10xysdc",
    "post_content":"I know it's been three years, but several people still asked me about it because they saw my post on tik tok or other media.<br/>So I wanted to make this post to thank everybody who gave me such kind and sensible advice three years ago. Even though I didn't reply, I read most of the replies, good or bad. And I am thankful for all of you who encouraged me to give my daughter a second chance.<br/>I'll summarise it: I went back to Miami and she gave me a heartfelt apology and explained all the dark things her boyfriend was getting her into. We got into therapy once again, she left her abusive relationship and these past three years our relationship has become better than ever! It was not easy, but definitely worth it. I'm glad I didn't give up.<br/>Thanks reddit!",
    "post_title":"UPDATE: AITA for not forgiving my daughter",
    "verdict":"NTA"
  },
  {
    "post_id":"10vdsqq",
    "post_content":"So, I live in the eighth floor and fyi my hallway always smells like weed. And I smoke but what I do sometimes when it’s cold I would open up my window and puff it outside so the smell won’t be stuck at my place. The neighbor who lives a floor above me had her window opened and smelled it and started yelling. I didn’t apologize or said am sorry for the inconvenience but I said instead of yelling you can just go ahead and make a complaint about me in the leasing office because I didn’t want to engage in a verbal argument. See all I think is sometimes the vent brings some smells or even when I have my windows open I can smell someone else’s cooking and I may not like it but I just end up closing my window. Do you guys think I should of apologized?",
    "post_title":"AITA for telling my neighbor he can go and make a complaint directly about me smoking out my window?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xkc60",
    "post_content":"So my friend has this wired thing where if you ever speak in a criticizing way to him or negatively he will go mute and cease all communication for a few days before coming to his senses. I love this guy but it’s very frustrating when he does this or other things like call him out for backing out of plans without telling extra. So I one day snapped and just let loose and started complaining and calling him out for his bullshit among other things, he has avoided me and is angry at me and when I try to reconcile and logic my way through this he tells me to fuck off and such, I feel a little guilty. Am I the asshole",
    "post_title":"AITA for confronting my friend?",
    "verdict":"YTA"
  },
  {
    "post_id":"10tyffo",
    "post_content":"My fiancée (23F) and I (24M) are getting married in June, and wedding planning is in full swing. She’s come up with a lot of great ideas for the ceremony, but there is one thing we’re currently at a standoff on: she wants to play “Cbat” as she comes down the aisle.<br/>Now, we’re both quirky and fun-loving, and I am not opposed to having some off-beat elements in our wedding. But as much as I laughed at the Cbat post when it appeared, I think the specific sexual connotations with that song are going to make people wonder about our relationship and sex life and I think it’s inappropriate for that reason. My fiancée doesn’t care about the connotations, and thinks it would just be a hilarious song to play, and is kind of upset at me that I don’t think it would be funny. AITA here?",
    "post_title":"AITA for not wanting “Cbat” as our wedding processional?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vfrnh",
    "post_content":"So I (20nb) have always been a bit strange when it comes to grief I just don't really. I honestly think it may be because of my autism I process those emotions differently. I'm upset when I find out someone close dies of course but it's never visible like I don't cry and tend to move on very quickly. Anyway my uncle died last week unexpectedly and the funeral was this last Saturday and I didn't cry or show any grief at all.<br/>After the funeral my mom comes up to me crying asking why I was being so horrible. I was confused and asked what she meant and she said I was being awful and acting like I didn't even care her brother is dead. I tried to explain I do care but she wouldn't listen she just kept yelling about how I was an emotionless robot and \"why couldn't I just be normal\". I don't know what to do. I swear I do care about my uncle I just can't visibly grief the way she wants me too. Am I the asshole? should I've been more upset? am I not normal?",
    "post_title":"AITA for not acting “correctly” at a funeral?",
    "verdict":"NTA"
  },
  {
    "post_id":"10v4pki",
    "post_content":"My 15-year-old daughter showed me on her online high school portal an assignment from his history teacher which stated:&gt; You must listen to Chapo Trap House, and compare and contrast articles on the phenomenon. You are also required to write one article in support of the phenomenon as if you were an adult living in 2016, and one against it, from this perspective. Write in-character for this. Also state if you enjoyed the material too, writing from a historian's perspective.<br/>I decided to anonymously contact my daughter's school principal under a generic-named Gmail account I set up in 2013 for things I don't want to my main email account (adverts etc.), and inform her of this, and am now waiting on a reply. I didn't state anything that could identify myself.<br/>Isn't now a bit too soon to start studying the Chapo Trap House movement in school history lessons? My husband thinks so.<br/>AITA for being concerned about what my school is teaching.",
    "post_title":"AITA for anonymously contacting my daughter's school principal over something she had as a school assignment?",
    "verdict":"YTA"
  },
  {
    "post_id":"10uue3r",
    "post_content":"Our household is scent free. We don't spray perfumes, use air fresheners or even scented laundry detergent. If it's a scent, it is an essential oil or naturally occurring fragrance. . It is our preference for nose sensitivity and health reasons. We have two younger children, 3 and 6, who have never been exposed to these types of chemicals in our house. We understand the outside world cannot be held to these standards but if his room is in on the same floor\/VERY close vicinity of the littles, is it reasonable for us to ask him not to use those things in our house? Trying to judge reasonableness before we seem like assholes, what is this communities opinion? TIA",
    "post_title":"AITA I(30F) am thinking of asking my to stepson(19M) to stop spraying colognes\/perfumes and burning candles in his room?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xu0bj",
    "post_content":"I (f15) answered the door today. There was some guy at the door selling clothes and my mom (50) is shy around men (we have a video camera door bell) so I went with the classic “habalo no inglis” even though the guy was speaking Arabic, in an Arabic speaking country. I was just my brain’s auto pilot and I just forgot he wasn’t speaking English. So anyway my brother (m20) came over and got mad that I had answered and that I was stupid for saying that. Didn’t really matter to me since the guy was gone and even if what I said was weird I’ll never see him again, he doesn’t know my face, nor my name, not even my real voice. And if he did it’s not the end of the world. He ended up getting madder later in the day but I don’t get the big deal. So AITA?",
    "post_title":"AITA for answering the door?",
    "verdict":"NTA"
  },
  {
    "post_id":"10xe5b3",
    "post_content":"I’m traveling from NYC to visit my friend in Ithaca. This friend just texted me and told me that another one of his friends, who is gonna be in Ithaca on those same dates visiting one of their mutual friends, wants to get lunch with him and he said yes. This makes me upset because Im only gonna be in Ithaca for a day and a half, and we had made our plans way in advance. And I don’t know anyone else in Ithaca either, so it’s not like I can just go do other stuff. Yes ofc I can go do stuff on my own, but the combination of the fact that we had made our plans first plus the fact that I’m only there for a short time makes me mad at my friend for making other plans while i’m there. Am i the asshole?",
    "post_title":"AITA for getting mad at my friend for making other plans while I’m visiting them?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xn3rw",
    "post_content":"Back in 2018 my neighbours were moving to UK and asked if we could take care of their 2 pet rabbits.<br/>I bonded with the rabbits and i had it for 5 years , when the neighbours moved back here a few months ago they didnt ask their pets back as i had it way longer than they had.  when i told others about this , many were saying i was an asshole for not returning pets to their owner and i was only asked to take care of them. so Aita?",
    "post_title":"AITA for not returning my Neighbours pet?",
    "verdict":"NTA"
  },
  {
    "post_id":"10zvecw",
    "post_content":"I (M28) recently got married to my now wife (F26). We had about 40 people there, and It was lovely.<br/>Now, the reason I didn't invite my sister Is mostly because of her attitude. She loves being better than people and berating others. Last time we were at a wedding for my cousin, she wore a white dress with  white pearly earrings and white high heels. My cousin was so upset and after my sister got scolded, she was grinning.<br/>She has also worn white to funerals before, tried to steal the spotlight at multiple birthday's and has ruined reunions before.<br/>It has gotten so bad, even our immediate family has requested she stays home when we meet.<br/>Now that's out of the way. My wife Is really sensitive and Is the type to cry easily. The thought of her crying was enough to not invite my sister.<br/>My sister has also shown multiple times that she dislikes my wife.<br/>She has practically blow up my messages, and tried to guilt-trip me by telling me she's crying so much due to me breaking her trust.<br/>AITA?",
    "post_title":"AITA for not inviting my sister to my wedding?",
    "verdict":"NTA"
  },
  {
    "post_id":"10x174m",
    "post_content":"So, for context, I am not a big fan of dogs in terms of living with them. I love them when I see them out and about or at a friends place, but I appreciate my space dog-free at home. For more context, my boyfriends dad is terminally ill, and doesn’t have much time left. My boyfriend wants to get a dog that resembles his childhood dog once his dad passes away. Which, for the record, I’d be willing to compromise on. However, he will not consider a different breed other than the huge dog-bear St. Bernard itself. I have already agreed to getting one once we move, (which is already a huge compromise because I never wanted a dog to begin with, especially one of that size. and the slobber….) but I will not agree to him to getting one while we live in a just-short-of 700 sq foot one bedroom apartment. He still insists on getting one, regardless of the lack of space and no consideration towards our 2 cats we already have in this tiny apartment. Am I in the wrong here?",
    "post_title":"AITA for not letting my bf get a dog?",
    "verdict":"NTA"
  },
  {
    "post_id":"10vn7hb",
    "post_content":"Every time i text this person, they get bent out of shape because i send them 5 'one sentence' texts instead of one '5 sentence paragraph.' I say they are passive aggressive and being a control freak. They say i don't understand phone etiquette. Nobody else says this to me. Nobody else seems to mind that i don't condense my messages into one long paragraph. Other people text me lots of little messages. I don't mind whatsoever. AITA for sending 5 one liners instead of one long message?",
    "post_title":"AITA for not condensing messages?",
    "verdict":"YTA"
  },
  {
    "post_id":"10y07gr",
    "post_content":"First of all sorry for the translation mistakes, Since the 6th of February Turkey is preoccupied with an ongoing earthquake disaster,There's a lot of dead and wounded people.<br/>we are all so sad about that and trying to recover.<br/>Me and my friends try our best to help  As for what happened.<br/>All of the schools in Turkey declared holiday until February 20.And my friend posted a picture of ourselves on her story with sharing that information then i added the story to my private account.<br/>A random girl replied to my story saying \"You are an asshole because you're happy it's a holiday for school,there are peoples dying and you can find something to be happy about\".We didn't even think about the earthquake when we saw the holiday news,we really didn't mean to hurt anybody while posting it.<br/>We were just happy for the holiday as all the students!I feel so bad and strange for it.<br/>I never thought people would think like that.<br/>AITA for posting it?",
    "post_title":"AITA for being happy about holiday",
    "verdict":"YTA"
  },
  {
    "post_id":"10v5vea",
    "post_content":"I wanted to go out drinking Friday night with my \"friends\" even though my wife told me she needed me. For context her father is in the ICU on life support and the power has been out at home all week from a winter storm and she was stuck there taking care of the kids. She said she would rather me come home because she was having an anxiety attack that just wouldn't go away because she was discussing with her brother all day weather or not to take her dad off life support. But I feel like I've had a long week and wanted to go drinking. So I went anyway. So, am I the asshole?<br/>Edit: id had a long week at work. I just wanted to have some fun. She doesn't even work",
    "post_title":"AITA for going to \"play pool\"?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z4u0q",
    "post_content":"So I live in the upper mid west where snowfall is expected during the winter. Yesterday we had a winter weather advisory where we got around 5 inches of wet snow. This morning I woke up and was walking to class and over half the sidewalks in front of peoples houses were essentially pure ice with no sand. I then wanted to see what others in the community thought so I posted a picture of a very long, pure ice, sidewalk and said “why don’t people shovel?”, not as a genuine question but more so voicing my frustration with the fact that my sidewalk is clean and dry while others neglected to even put some sand over the ice. The reaction I got was not what I was expecting as I was downvoted to oblivion and received a few heated comments towards me attacking my personhood😂 I know I am the idiot for posting with an expectation, but am I the asshole?",
    "post_title":"AITA for posting\/complaining about icy sidewalks the morning after a big snowfall?",
    "verdict":"YTA"
  },
  {
    "post_id":"10z3beo",
    "post_content":"I will use my most recent date as an example, and as banale as it sounds, it turned into the topic of strippers. And it came to her attention that in my opinion, there is a difference between strippers who dance for money from men and strippers who dance for fun, I conveyed my opinion that the strippers who dance for money from men basically lose a little of their souls bit by bit. And she asked me (as a follow up question) if I ever would date somebody with an onlyfans, and I put a hard no on that.<br/>I dread first dates, because I dont know of there is something wrong with *how* I tell my opinions on matters, or if my opinions themselves make me a total a-hole?",
    "post_title":"AITA and the reason for not getting anywhere with my first dates?",
    "verdict":"YTA"
  },
  {
    "post_id":"10tqr9z",
    "post_content":"Ok so me (26F), my girlfriend Pauline (33F) and my girlfriend's girlfriend Lindsay (36F) (we're polyamorous) went to a Denny's. Lindsay thought the waitress was cute, and is a shy type, so word for word this is what I said:  \"Okay, so two things. One, my friend here thinks you're cute. And two, could we get a couple extra pancakes to go?\"  Lindsay turned red, trying her best to hide her face in her hair (smiling, though in embarrassment or anxiety I am not sure), the waitress didn't seem bothered, joking that I've made her turn beet red, and me and Pauline were having a good giggle.  Afterwards, I told the waitress that I was sorry if I overstepped boundaries when I went up to her to ask for some extra syrup, and she said something along the lines of 'it's okay I've had worse'. I feel like I was an asshole here... Please let me know what the decorum might be, or if I should just not mention anything at all when I or any of my party think waitstaff are cute. Thank you.",
    "post_title":"AITA for telling a waitress my friend thinks she's cute",
    "verdict":"YTA"
  },
  {
    "post_id":"10v35d5",
    "post_content":"I (17M) have a very strict teacher named Ms. Jones. I also have a weird bladder condition, not exactly sure what it is because I haven’t been to a doctor in 2-3 years, where my bladder seems to be a lot smaller as I constantly have to pee. Ms Jones doesn’t really like me constantly having to get up during almost every class she has had to have to go pee.<br/>Today I was in class with her where I had once again asked if I could go pee, to which she responds no, and that I take too many bathroom breaks. I wait a few minutes for her to wrap up what she’s doing and ask again, which she once again says no. Since I don’t want to ruin my clothes and I desperately needed to pee, I just decided to take a leak in her trashcan. I got written up for this and my parents had to be called, and I’ve been grounded for doing this. AITA?",
    "post_title":"AITA for peeing in my teachers trashcan after she wouldn’t let me use the bathroom during class?",
    "verdict":"NTA"
  },
  {
    "post_id":"10ydv4w",
    "post_content":"I’m at work and my coworker is taking an order on front counter. Part of the order is “Caramel Frappe” which was worded as “Caramel Frappuccino”. [My coworker] hears it as “Caramel Cappuccino”. I read those words sensing something suspicious. I had to step in to confirm whether it was a frappe or a cappuccino. It indeed was a frappe. I did it to make sure a 1-800 complaint was avoided. Thanks to her limited English, her lack of understanding of English does lead to 1-800 complaints. To specify what a 1-800 complaint means, it’s a corporate complaint customers make.<br/>Three minutes later, she approaches me, and instead of thanking me for helping her, she told me off saying she would write me up, which I don’t know whether she’ll do or not. I explained the difficulty of even me understanding whether they wanted that cappuccino or Frappuccino, but she was dismissive.<br/>I wanna know from you guys, AITA because I did what I did?",
    "post_title":"AITA for intervening just to be sure I gave my customer what she wanted?",
    "verdict":"NTA"
  },
  {
    "post_id":"10xwnmw",
    "post_content":"Possibly too petty to be an AITA but curious what others think. My wife was packing my son's lunch and she asked me to grab some crackers. As I was looking in the pantry I asked what kind of crackers and she replied in an exasperated bordering on annoyed voice \"just pick any cracker\". The next cracker box I saw were animal crackers, so I grabbed those and started to put them in a bag for her. Even more annoyed now, she said, \"I said crackers, not cookies\". I said that animal crackers literally have 'crackers' in the name, and if she wanted a certain type of cracker she should have specified. We bickered for a bit and then she very confidently declared \"ask anyone, they'll agree\". I think she ITHA, but was she right?",
    "post_title":"AITA? \"Just pick any cracker\" she said",
    "verdict":"YTA"
  },
  {
    "post_id":"10yeqj6",
    "post_content":"I started a new account and since I spent a certain amount of money in the first few months I’m getting $200 back. We are ordering a microwave as the final purchase and my boyfriend is ordering a desk(which he wanted for a while and He will pay for it) we are buying these now because I needed to spend the last amount to qualify for the $200. So I said we should charge it to my card before the deadline. I said maybe we could use the money to pay for the microwave but then later I asked maybe if he could pay for a little bit so I could put more of the $200 towards something. He argues a lot of what I spent on that card was his money as well ( we split everything so if I payed for him on my card it would go on his tab vise versa). I Wanted him to pay maybe $35 of a $107 microwave. Am I the asshole? He’s making me feel selfish but maybe I am?",
    "post_title":"AITA for wanting my bf to pay for part of the microwave even though I’m getting cash back for my credit card?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xecdf",
    "post_content":"I (20F) am on a college campus that had a pipe break causing a town wide contamination emergency. Our campus was distributing cases of water for students to drink until the water is fixed. We got an emergency email telling us cases of water would be available for the taking. I grabbed one of the cases, planning to take half of the water for myself and the rest for the campus food pantry, which to my knowledge wasn’t being stocked. A lady in the res hall yelled at me and an email was sent out clarifying that we weren’t made to take a case, but rather only 3 bottles (which was not stated in the original email). I feel like a moron but at the same time, I wasn’t hoarding just trying to help the community. I do a lot of physical activity so I figured I would need more than 3. I wasn’t trying to hoarde but if I am the Ahole, I’d rather know so I don’t do anything like it again.",
    "post_title":"AITA for Taking a Free Case of Water during a water emergency?",
    "verdict":"NTA"
  },
  {
    "post_id":"10yhb4m",
    "post_content":"Went to a restaurant  went to the sed robster and wanted to order an appetizer. Asked the server does this have cilantro or chipolte he said no I don't think so I asked him to check he did not and brought is anyway well all the green stuff all over the plate is cilantro and he had to put t on after it came through the hatch from the kitchen I sad again that cilantro made everything taste like dirty dishwater. He said oh well it is parsley I said yeah sure it is.  tasted it and dirty dishwater. I asked for one with out garnish then he said well I have to charge for both. I then said I want your manager. he rolled his eyes and got the manager explained again about my weird taste buds and she got me another one and then took it completely off the bill. Server still wanted to put cilantro on everything and the manager interceded and finally just took over our table. The server shot me dirty looks all night. but am I the asshole here. I just don't want food to taste like dirty dishwater.",
    "post_title":"AITA if told you Cilantro and Chipolte taste like dirty dishwater and you served it anyway?",
    "verdict":"NTA"
  },
  {
    "post_id":"10z5fky",
    "post_content":"I (21F) and my boyfriend (26M) were having a conversation about marriage and he said it's easy for women coz all they do after getting married is enjoy and you might say women give birth which is painful but technology has made everything easy you get a c-section done and you're good to go, painless delivery. We've been dating for a year now and it's really bothering me that I find him so misogynist. I couldn't take it when he said pregnancy and giving birth is easy i screamed at him out of frustration, cried and left abruptly. I couldn't take it because a month ago I had to terminate our baby and it was painful and i couldn't imagine how painful giving birth would be, him belittling it made me lose my shit.",
    "post_title":"AITA for screaming at my boyfriend because he said all women do is enjoy",
    "verdict":"NTA"
  },
  {
    "post_id":"10vb9zw",
    "post_content":"So about 2 1\/2 months ago me (f15) and my dad fought about me not being social, and it all happened because I refuse a hug? He started going on a rant and saying how I don’t socialize with others. At the end he said he’ll take me to the psychologist, I didn’t believe him cause he always forgets things so I said sure. Then yesterday my mom came up and said I have an appointment on wednesday with a psychologist. I wouldn’t say i’m scared just a bit nervous. Am I really arguing over something dumb or not?",
    "post_title":"AITA for thinking it’s unnecessary for me to have “social help?”",
    "verdict":"NTA"
  },
  {
    "post_id":"10ze4n1",
    "post_content":"Couple nights ago I was out with my girlfriend and other friends. There’s a guy my girlfriend and her friends know but I barley know him. Actually I don’t know him at all and he’s never been very nice to me. Always standoffish and unfriendly.<br/>I was pretty drunk and at some point this guy came up to my girlfriend and put his arm around her right in front of me. At first I tried to ignore but it annoyed me so I removed his arm and said “don’t do that it’s weird” and that was it. Went back to talking to some other people.  My girlfriend and her friends think I was a really big jerk for this. I tell them it’s a respect thing. That I would never put my hands on another girl especially when her boyfriend is someone I’m not friends with. They keep saying I’m a pig and she’s not my object. But I wasn’t trying to fight him or even care if their friends. It just made me uncomfortable and I had to say something. AITA?",
    "post_title":"AITA for not liking other guys putting hands on my girlfriend?",
    "verdict":"YTA"
  },
  {
    "post_id":"10zi02i",
    "post_content":"We've been together for nearly two years and in that time he moved into a new flat with a private bathroom. I live nearby so we often swap where we stay over. Whenever I go to his I nag him to clean the bathroom. It's dusty, like the corners have a hairy, thick layer of dust. And the sink, toilet, and shower could all benefit from a simple scrub. He doesn't struggle with depression or anything that would limit his ability to take on these taks. He has clearly said that it is a matter of preference. That he would draw the line if it were dirtier, but he believes it doesn't pose any issue. I've told him I'd be happier if he cleaned it. He says it's a good opportunity to practice being out of control of a situation. I think he's low-key right, but I share the space too. And as for the living at home. I moved home recently. But when I had my own place I kept the shared bathroom clean.",
    "post_title":"AITA for expecting my (f22) bf (m25) to clean his bathroom",
    "verdict":"NTA"
  },
  {
    "post_id":"10xe5ky",
    "post_content":"I told my mom I wanted to take her to a Mana concert as they are one of her favorite bands. While looking at ticket prices, I called her up and was surprised to see they were more expensive than I thought they would be. I jokingly said “wow $120 to see this band? No offense they ain’t no Harry Styles.” I said this in a joking matter. My mom said maybe we shouldn’t go then she made an excuse to end the call. When I texted her back letting her know I was kidding, she said she wasn’t so into the idea anymore. I let her know that of course I was kidding, I grew up listening to Mana and I still wanted to go. I was just genuinely shocked to see the ticket prices, but I make a decent wage so of course I’ll still buy them. AITA?",
    "post_title":"AITA for jokingly criticizing my moms favorite band?",
    "verdict":"YTA"
  },
  {
    "post_id":"10wohlp",
    "post_content":"AITAH?  My best friend isn’t using my husband as her realtor.  My husband has years of experience, is licensed in multiple states and has given my friend and her husband his time and advise multiple times when they’ve had real estate questions in the past.<br/>I knew my friend was considering a move and I’ve tried to talk to her about using my husband but she was cagey and kept saying she wasn’t ready to start seriously looking yet.  After she accidentally let it slip she was looking at houses this weekend I again asked about my husband and she finally said she is using her previous realtor. I feel really hurt and betrayed and told her I needed some time (we were supposed to go hiking this weekend and I cancelled).  Am I over reacting or is she an asshole?",
    "post_title":"AITA? Best friend not using husband as realtor",
    "verdict":"YTA"
  },
  {
    "post_id":"10v5huy",
    "post_content":"My wife(34f) and I (33m) were looking at YouTube videos of Paris and I pointed at a cafe that I once visited. She replied with “let’s save up and go there next”! Even I said let’s go. And I stupidly followed by saying “London has got nothing on Paris” and she shook her head and said that’s not true!My wife used to live in London for a long time before she met me. So it’s very special for her. But then I jokingly said “do you know what they say about London, Paris and Berlin?   That London is your old housewife, Paris is your muse and Berlin is your mistress!”.<br/>I honestly said it as a joke but she called me an asshole and now she won’t talk to me…So we posted here to see what you guys say was it an asshole thing to say? AITAH??<br/>Edit: She says I scrunched my nose when I said old house wife and smiled widely when I said mistress. She asked me if that’s what I will think of her when she is old…",
    "post_title":"AITAH for saying to my wife that Berlin is like a mistress?",
    "verdict":"NTA"
  },
  {
    "post_id":"10zh431",
    "post_content":"AITH for refusing to talk to my husband after her swears at me?My husband always swears at me when he gets annoyed and I’ve asked him for years not to swear at me because it’s disrespectful and makes me feel worthless and unloved. He did it again this morning again ( it’s been a few times this week now) and I walked off and did my own thing all day. We haven’t spoken since and he’s ignoring me. AITH for not talking to him until he acknowledges that it’s not ok to talk to me like that.",
    "post_title":"AITA AITH for refusing to talk to my husband of M4 years M46 after her swears at me F43?",
    "verdict":"NTA"
  },
  {
    "post_id":"10x9am1",
    "post_content":"Back story: I left social media because I was fed up that my family was talking to me only to complain about their problems and asking for money. They don’t care about me unless it’s when they need money. I used to help them but I don’t want anymore. I am not a bank I have feelings too.<br/>Since I left social media, my family can’t reach me anymore. Now they are sending messages to my sister who has my number to ask me for money. My sister transferred me the messages. First message is my brother asking for money because he is sick. Second message is my mother asking me to pay her glasses prescription. I did not answer till now.<br/>My family is really bad with money and think I have to help them as soon as they ask. Brother has a low-paying job, married and have 3 kids and still live with my parents. My parents still providing for him and his family. My parents never knew how to manage their money.<br/>AITA if I just ignore them?",
    "post_title":"AITA for not giving my family money when they need it?",
    "verdict":"NTA"
  },
  {
    "post_id":"10yq6s4",
    "post_content":"If this post comes off as blunt, I'm not trying to be. I'm just trying to get to the point and keep it as short as I can.<br/>My cousin passed in an accident a last week, which is devastating. What's going on now is that me and my fiance have our engagement party coming up soon. My mom is telling us to postpone it because everyone in the family is going through a tough time right now. I told her we've everything is set and it's going to be a hassle to change it all now. The venue does allow changes, but the earliest availability they have after our date is in April. No one postpones something like this last minute and we don't want to have to wait until then, and I told my mom I'm truly sorry for what happened but people attending our party can cheer them up after this tragedy.<br/>She said I was acting selfish.<br/>AITA?",
    "post_title":"AITA for not postponing my engagement party?",
    "verdict":"YTA"
  },
  {
    "post_id":"110byhz",
    "post_content":"Throwaway account; I(25f) am a current college student renting an upstairs bedroom with an older couple and their adult kids. Everything has been okay, and we all keep to ourselves for the most part while saying hello when we cross paths. However, the husband (70m)‘s home office is below my room, where he will be making loud international calls from midnight to the early morning—sometimes making it hard for me to fall asleep. They commented when I first moved in about me staying up late since they heard my desk chair rolling around at night. I promptly purchased a chair mat to ensure I didn’t make any noise that can bother them. I have my licensing exam soon, and the husband has been on his nightly phone calls from midnight to almost 4:00 am. WIBTA if I asked him to talk quieter at night? TL;DR My landlord makes loud international calls all night, which makes it hard to sleep. WIBTA to ask him to talk quieter?",
    "post_title":"WIBTA to tell my landlords to be quiet",
    "verdict":"NTA"
  },
  {
    "post_id":"10xciwk",
    "post_content":"Okay so basically ive been thinking about this for a long time well basically my grandfather was in a short term visit (waiting for them too die basically) and me and my whole family was there my hair was a complete mess near my roots i mightve accidentally bleached a ton of hair off and it looks horrible that day my grandfather was literally in his death bed and my dads sister asked me too take my hood off and i said no my hairs a mess id be ashamed and she said ''he could die today.'' (he didnt die that day but he is dead tho.) so am i the asshole for not taking my hood off so my grandpa could recognize me even tho he was sleeping all the time?",
    "post_title":"AITA for not taking my hood off?",
    "verdict":"YTA"
  },
  {
    "post_id":"10wrxt6",
    "post_content":"My stomach hurts really bad and I’m not sure what the cause is, I just moved into a college dorm room where I share the bathroom with one other person. I’ve been out all day at work and have just come home in the late afternoon and am having really bad shits. I don’t usually take long, so this is the first time. In general do  roommates understand or do u think my roommate will get mad at me? We also have a ton of toilets in the building on the common floors, I used the one in the apartment because I was in the bathroom just about to take a shower when I realised I really needed to go. Any advice is helpful as I’m new and learning to navigate shared situations.<br/>EDIT: Thanks for the help, it was a genuine question and im glad that a situation like this is generally understood.",
    "post_title":"AITA for taking ages in a shared bathroom when I have diarrhea?",
    "verdict":"NTA"
  },
  {
    "post_id":"10z5dxb",
    "post_content":"Recently, I was taking the subway home from work.<br/>When I got in the car, somebody was smoking and it reeked of weed - to the point where at the first stop I switched cars.<br/>Generally speaking, I don't care if people smoke on the subway, even though the subway forbids smoking inside. Even weed, if people choose to smoke at home away from others, that's none of my business. When I got to my stop, I called the non emergency line to report it. I don't want the people smoking brutalized by police or something, but I don't want my subway to reek whenever I get on and I don't want to smell like weed. Frankly, I think if you choose to smoke weed in such a blatant manner, on the subway, in public, you sort of accept whatever legal consequences there might be. AITA?",
    "post_title":"AITA for calling the non emergency line on people smoking weed on the subway?",
    "verdict":"YTA"
  },
  {
    "post_id":"10zh43l",
    "post_content":"I just moved into my new apartment today and I had a friend visit me from out of town. Apartment is 1bed\/1 bath. He ends up bringing another girl from his town and they both stay with me. He also invited another friend while we are here. Well we go out and come back and are hanging out in living. His friends ( the girl) goes to sleep in my bed. I let her for an hour or so but when I’m ready for bed I wake her and ask her to move to the living room. The other 2 guys are in there and I hear him say to her “did she kick you out???”  I said “sorry girls name” and closed the door. AMITA for kicking acquaintance out of my bed?",
    "post_title":"AITA for kicking girl out of my bed",
    "verdict":"NTA"
  },
  {
    "post_id":"110vfj2",
    "post_content":"For context I (M24) and my friend F(23) were at a party. She’s a very pretty woman, and the way she was dressed\/had her hair style she looked like Lucy Liu. Let’s call her J. She didn’t seem uncomfortable by this, but one of her friends pulled me to one side later that evening and said I was super racist for what I had said. I apologised to J immediately. Her and her friends didn’t talk to me for the rest of the evening. AITA here?<br/>EDIT TO ADD FURTHER CONTEXT: I have been rewatching elementary, and I made this comment because her outfit and the way she had styled her hair reminded me of Lucy in one of the episodes. J is Chinese, we have been friends for some time. J is very proud of her heritage and I have been very interested in going along with her.",
    "post_title":"AITA for saying my Asian friend looked like an Asian celebrity?",
    "verdict":"YTA"
  },
  {
    "post_id":"10urpsw",
    "post_content":"My friend (39m) has been a widow for 6 months now. He has been grieving, as they were married for 13 years. I suggested he go out with some friends and have dinner. He calls me and tells me he’s home early and didn’t have the best time. But his wife’s step mom was coming over to drop some items off for his son, her grandson. Whatever took place caused them to end up having hooked up multiple times that night. AITA for telling him and her both it’s weird and can confuse the kid later on? They both want to continue this. She was the wife’s step mother since she was 7, and is also a widow as her husband passed away in 2018.",
    "post_title":"AITA for telling my friend he’s wrong",
    "verdict":"YTA"
  },
  {
    "post_id":"10vdien",
    "post_content":" Original Post: [https:\/\/www.<br/>reddit.<br/>com\/r\/AmItheAsshole\/comments\/10qxxm8\/aita\\_for\\_refusing\\_to\\_lie\\_for\\_my\\_wife\/](https:\/\/www.<br/>reddit.<br/>com\/r\/AmItheAsshole\/comments\/10qxxm8\/aita_for_refusing_to_lie_for_my_wife\/)The inspection came and went. The good news, there was no drama. I warned the agent about what happened and my wife filled her in on the family backstory. She was very understanding. FIL did not bring step-MIL, but did bring up the \"cousin\" thing ...... as expected, he waited until I was not in the room. He seemed convinced he had met her at a family gathering before (lol!), and she even played along.<br/>It turned out for the best, because there was no drama. I did not get put in a position of being a liar myself or letting the cat out of the bag on my wife, and there were no hurt feelings on the other side either. That's not to say this won't come up again down the road. My wife is actually more resolved now to rip the band-aid off.",
    "post_title":"UPDATE: AITA for refusing to lie for my wife?",
    "verdict":"NTA"
  },
  {
    "post_id":"10v6rj7",
    "post_content":"When I get into arguments, I vent to my friends like any other person does. Yesterday my gf ended up finding out that I was talking shit about her to my friends. She was even more mad about me talking shit about her to my friend Tiffany.<br/>I showed her the conversation and she saw some messages where Tiffany and I flirted a few weeks before my gf and I started dating, where I called Tiffany attractive. She got upset but those messages were from before so they don't matter. Now she won't talk to me and called me an asshole for talking shit about her to everyone. I think I have the right to vent to anyone, no matter the gender and I think she's blowing this out of proportion. But my gf thinks I'm in the wrong and said my messages implied that I didn't care if she died. AITA?",
    "post_title":"AITA for talking shit about her to my friends?",
    "verdict":"YTA"
  },
  {
    "post_id":"10vgvjb",
    "post_content":"I 18 y.<br/>o been recently talking to girl that i really like and turns out she like me too . So she tolled me she's best friend with my friend sister and start talk a lot about her until she finally brings up about her relationship . So after few days i meet her brother (my neighbour) and told him about his sister without mention the whole story  later that day the girl i like got mad at me and blocked me because the brother got mad . Am i wrong for this ? ( and also im arabe )",
    "post_title":"AITA for telling my neighbour and my freind about his sister",
    "verdict":"NTA"
  },
  {
    "post_id":"110xl3z",
    "post_content":"My sister (26f) gets very angry with me (23f) every time I enter the kitchen if she is already in there, saying I should obviously know to wait until she's done because I'm \"getting in her way\". The last time this happened, I microwaved a burrito while she was at the stove, today it happened because I was putting food in a bowl to microwave while she was at the sink. Today she actually told me it's a huge \"social faux pas\" and \"widely known to be extremely inappropriate.\" I try to not get in her way and be quick but she bumps into me and grunts a lot, as if I am a huge inconvenience no matter where I stand in the room. This fight usually(including today) ends with me saying she's being selfish and then her saying something along the lines of \"yeah well you're the most self centered person I know\" or in some other way taking a jab at my character. Is it actually a social faux pas? I've never heard of it, and if it is would it apply to siblings who live together in their parents' home?",
    "post_title":"AITA for using the kitchen while my sister is already using it?",
    "verdict":"NTA"
  },
  {
    "post_id":"10tyyp4",
    "post_content":"I (24 f) had made prior plans with someone for the weekend to study. On the day of, another friend (24 f)  invited me to have lunch. Without looking at the commute time, I said okay. After checking the commute, I realized that I would waste almost 2 hours of my day which seemed a lot. I let my same friend know as we were planning for it that it would be far for me and I have work. I gave her other options to meet another day, next weekend or even in the evening after I am done with some work. She straight up told me “don’t come, I am very irritated”. I apologized for not being able to make things work. Called her. She did not pick up and basically won’t talk to me. Am I the asshole in this?",
    "post_title":"AITA for canceling plans because of work?",
    "verdict":"YTA"
  },
  {
    "post_id":"110w8c6",
    "post_content":"Me (15 f) and my step mom (40 f) got in to a argument the other day I was getting worked up. So i went into another room and started rocking my self back and forth to calm myself down. She came after and kept yelling then all of a sudden said “if you really were autistic which you are not since I work with kids that are autistic then why didn’t you show signs when you were younger. I was having a hard time trying to calm myself cause I’m sensitive loud noises. I replied “Autism can often be missed diagnosed as ADHD which I was and symptoms can often show more when puberty starts” she started yelling I was faking it for attention and other stuff so I yelled “can you please stop yelling at me” I been getting at lot of backlash from yelling and I feel really bad so Aita?(Step mom works with special need kids)",
    "post_title":"AITA for yelling at my step mom after she said I don’t have autism",
    "verdict":"NTA"
  },
  {
    "post_id":"10uoox3",
    "post_content":"Would I be the AHole if I told the restaurant owner what the head chef and I used to do there? (What we did is 100% nsfw) and although I am at part for it, I no longer work there and will bare no responsibility. (This happened with my head chef, my manager) we were not official but A. Lived together and B. Were exclusive (his words).Side note: he now plays the \"we were never a couple\" card when I found an earring by the bedside (I don't have earring holes) and this is pretty much over, as I can only take so much bullshit.<br/>I can't say this isn't at least partially a need for revenge, but I do think the owner should know who he pays to run his place, as I found pictures proving I'm not the only coworker he did things with. (I can only hope it's the same girl as the one who left the earring here).TL;DR: would I be the AHole if I told my former boss that I and the head chef did many NSFW things at the restaurant?",
    "post_title":"WIBTA if I told my former boss (the owner) what happened at his workplace?",
    "verdict":"YTA"
  },
  {
    "post_id":"10wgg04",
    "post_content":"So we've been friends basically all our lives. We did EVERYTHING together. Like connected to the hips connected.  But the older we got..the less we talked and after 10 years of being by eachother's side. he broke our promise and left me. We recently got re-united after years of not speaking and I called him some names and just let out years of things I havent been able to process well and he was crying, I don't know what I should do or if i should apologize. So reddit community...AITA?&amp;#x200B;TLDR: I might have made my old bestfriend cry by lashing out too harshly and that might have affected our relationship moving forward",
    "post_title":"AITA for making my bestfriend cry because he abandoned me for school and girls?",
    "verdict":"YTA"
  },
  {
    "post_id":"10yix4h",
    "post_content":"Backstory:so I have the “friend” she is quite a new friend to me but we hang out for a bit then one day we went to the toilet stalls in our school bathroom and saw vape packaging. The friend (new) went go tell the teacher on duty on the day and dragged two of my old friends with her to tell the teacher. One day later on discord one of the friends she dragged told me that “I don’t want you to tell the friend about me because I’m scared I’m gonna get hurt” or something along that line so I agree with them and that day I only say that person’s name once or twice, so I’m like “ok I did it”. Yesterday that same friend is playing with her and chasing her around after she told me not to tell that new friend about them.<br/>I feel like that their the asshole but I feel like I something about that they’ll just say “I just got over it” or “why are you bring it up?” I talked to a friend I can trust about and they agreed with me but I don’t know who’s the asshole in this. Am I the asshole?",
    "post_title":"AITA? My friend thing about my new “friend”",
    "verdict":"YTA"
  },
  {
    "post_id":"10v2mtt",
    "post_content":"Hi all, A few years ago I cut contact with my abusive father. A few weeks ago I found out that he has been diagnosed with cancer. I've been very emotionally withdrawn from this and I don't feel anything about his diagnosis. I've been told by numerous people to reach out to him and let him know that I am sending him well wishes etc. AITA for not wanting to contact him to offer him support with his diagnosis?",
    "post_title":"AITA for not wanting to contact my father about his cancer diagnosis?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uyqww",
    "post_content":"I was having a rare night out with my wife, our time was limited. My wife walked away to use the bathroom and the guy next to me, pulled out a bottle of salsa, asked me to try it (he had a bowl of self brought chips) and asked my opinion. I said it was good (to be polite, it was ok at best) and he asked me if I wanted to buy an unopened bottle of it for 12 dollars. After a couple attempts of escaping the interaction (my wife had come back at this point) I said, “how bout drop the 1”, implying I’d buy it for 2 dollars. I did not enjoy the salsa. AITA?",
    "post_title":"AITA for not wanting to buy salsa from a stranger at the bar?",
    "verdict":"NTA"
  },
  {
    "post_id":"110b1pn",
    "post_content":"I 22F used my boyfriend's car with permission while he is away traveling and accidentally scraped the side of it on a low wall.<br/>I am a student and need a car sometimes and I'm grateful he lets me use his.<br/>I took it to a shop which would do a good job and got a quote, and my mom is willing to lend me some money to fix it. I could get the car fixed before my boyfriend comes back.<br/>I am considering not telling him about the incident as a couple of months ago I backed into a bollard and he was very angry with me about it even though I paid to fix it.<br/>I am scared he will react badly and not be understanding like last time. I am careful and I'm not a bad driver and this isn't something that happens often.<br/>The car is a couple of years old and it is not an expensive one.<br/>WIBTA if I never told him and he never asked?",
    "post_title":"WIBTA for not telling my boyfriend I crashed his car if I fixed it before he knew about it.",
    "verdict":"YTA"
  },
  {
    "post_id":"10yttg3",
    "post_content":"Update: looks like the general consensus is I am the asshole for making him feel guilty.  I accept the judgment.<br/>Thanks for helping me see the situation from a different perspective. My youngest daughter lives with her dad. We split about 2.5 years ago and about 8 months ago moved to a city 1h drive away due to health, family, money and my new partner. I made sure I picked her up and drop her off every weekend, however 4 weeks ago got sciatica that made me unable to drive. I'm not able to sit for more than few minutes. My current partner helps me with my daughter and drives us places, picks her up and drops her off. I asked my ex (daughter's dad) to drive her one way because it's not fair on my partner to keep doing it but ex says he is not going to do it for me. I'm pissed off that my partner cares more that my daughter see me than her own dad. AITA for telling this to my ex, trying to make him feel guilty and me being angry and disappointed?",
    "post_title":"AITA for asking my ex for help?",
    "verdict":"YTA"
  },
  {
    "post_id":"10v4kvq",
    "post_content":"Right now I do feel like the asshole but for context I was recently diagnosed as autistic. Me and my psychologist think that's the reason I hate people touching me or saying compliments about me about 10 minutes ago I asked my mum to stop calling me pretty or baby girl because it makes me uncomfortable and makes me feel worse about myself me after I asked she got mad and yelled at me saying that I have to get over myself and just do what others tell me to, I hate that I allowed myself to get mad at her back I yelled that I did my 18 years of not thinking for myself and I finally have learnt to not let others ignore my bounderis she then told me to suck it up and that I'm acting like a child. Am I the asshole?(Sorry for the bad text this is my first time posting)",
    "post_title":"AITA for asking my mum to not call be pretty",
    "verdict":"NTA"
  },
  {
    "post_id":"10z8te8",
    "post_content":"I (28M) went on a weeklong trip to the French Alps with my roommate (28F) and a group of friends in mid-January. On the first day, she had a severe skiing accident, was helicoptered to a hospital where she stayed for 10 days before being med flighted back to the US. I was at her bedside the entire time and have fully supported her through her recovery at home. As a doctor myself, I was actively involved in all of her medical care, as well as followup appointments. She is now independent and on a route to full recovery. We have one friend in the area that is here to help her. Now that we’re a few weeks out, a group of my guy friends invited me to a local ski trip for a weekend. I haven’t gotten to ski yet this season because my roommate (also my fiancée) got injured the first day of the trip. AITA for going skiing after her injury?",
    "post_title":"AITA for going skiing",
    "verdict":"YTA"
  },
  {
    "post_id":"10z8cht",
    "post_content":"I (18F) am in University and I have a job. During high school when i was working, i gave my mom half my paycheques to save for my future. Anyways, gas prices are really high right now and I asked for my savings just in case i needed gas because it is very expensive. She got mad at me and told me i couldn’t have them. i didn’t say anything about it because i didn’t want to start an argument but i feel like i have to right to ask for my money because i earned it myself. i feel bad because i know she’s doing it for me but i would really like the extra money in case of emergency. So AITA for asking for my money?<br/>EDIT:Im adding this because a lot of people think she spent it. I saw it in the account 3 days ago. She’s being like this because both my older brothers had spending addictions and she doesn’t want me to end up like them. She would never take my money and I love her.",
    "post_title":"AITA for asking my mom for my savings?",
    "verdict":"NTA"
  },
  {
    "post_id":"10uknoe",
    "post_content":"To keep long story short.<br/>I had a grandma that I genuinely did not respect neither did she, though she stated otherwise. As far as I remember she was big toxic person and all of the visits to her was a nightmare for me. I am going to vacation tommorow (planned almost 4 months ago) and it seems that the funeral will be organised in the week that I am away. For my statement that she was not a close person for me and I am going to trip instead of letting go my plans away and attend the funeral of a person that wasnt even close to me, my parents went insane and called me that they raise a monster and I have them deep in the ahole. AITA for prioritising my own plans and not behaving like my parents want me to?",
    "post_title":"AITA (25f) since I dont want to attend my grandma funeral",
    "verdict":"NTA"
  },
  {
    "post_id":"10z0e31",
    "post_content":"I 20f have been with my bf 23m for 2 years. We have talked about our life goals, kids, marriage etc and we're compatible, except for one thing.<br/>When we first got together my boyfriend said I would be waiting until at least 2023-2024 for an engagement, which at the time I thought I was fine with. Now after we've been together for two years I realise that I wanted to be engaged sooner.<br/>My boyfriend and I have talked about this and he says he would rather be living together before we get engaged. I respect his decision and how he feels which is why I bought myself a ring.<br/>It wasn't expensive and I used my own money to pay for it. It makes me feel more secure in my relationship so I don't understand why my boyfriend is upset about me buying a cheap ring.<br/>I told my boyfriend he controls when he proposes and I can wait two more years, but he doesn't get to control what jewellery I buy myself and where I wear it. So Aita?.",
    "post_title":"AITA for buying a ring for my ring finger after my bf said I would have to wait 2 years for a proposal?",
    "verdict":"YTA"
  },
  {
    "post_id":"10wkj7o",
    "post_content":"Of course there's a backstory to this, but suffice to say, a very close friend of mines dog passed away, unexpectedly. I loved this dog very much a was heartbroken when he died. In fact, I went over to her house in the middle of the night after a hysterical phone call. My husband has never liked this friend of mine and feels she's too needy, and I've given her enough already. We are not struggling financially at all, and the sum borrowed was under $200. I didn't think twice about lending her the money, though I knew my husband would be angry. I just didn't tell him, but he noticed the transaction that same day, and was of course, angry. Am I the asshole for loaning her this money, given the circumstance? I mean, I loved this dog too and have been in tears for days.",
    "post_title":"AITA for paying for my friend's dog to be cremated without asking my husband?",
    "verdict":"YTA"
  },
  {
    "post_id":"10vyasq",
    "post_content":"We are currently arguing over this because it’s “the first thing she found” I’ve asked her time and time again to just wear appropriate clothing out of respect for me but when I go to her house and she’s wearing short everything while there’s guest and I ask her about it she starts arguing.",
    "post_title":"AITA for asking my gf to wear more appropriate clothing when there’s guest in the house?",
    "verdict":"YTA"
  },
  {
    "post_id":"10xmgwj",
    "post_content":"I (22m) was invited by my friends to go to Europe but I refused because I’m too old and I wish I was younger to get to experience traveling out of the country. I’ll never have that experience of backpacking through Europe at 16 and that must be so fun and cool. Now I’m too old and I  wouldn’t even be a young traveler. I don’t Have any experiences of me traveling and making memories at 16 and I hate myself for that. My parents really want me to go but I said no even though going to Europe is my dream.<br/>TLDR; my friend invited me out of the country but I feel rude rejecting them cause I’m too old",
    "post_title":"AITA for refusing to travel with my friends?",
    "verdict":"YTA"
  },
  {
    "post_id":"10uornk",
    "post_content":"TA accountI (M17) have a friend named “Jamal” (M17.) we have been friends since seventh grade, and are now seniors in high school. A few months ago, I started dating someone. A few weeks into our relationship, Jamal came came up to me during lunch and said he was my gf kiss another boy. I didn’t believe him and told him he was jealous that he could never get someone like mine and how he shouldn’t lie about people just because he has more money than them. He looked at me with confused expression just said wow and walked away. I later found out she was cheating on me and broke up with her. I was really hurt and wanted to talk to someone, but the only person I felt comfortable talking to was Jamal, but he hadn’t talked to me since I said that to him. I feel bad and want to apologize but I don’t think now is the right time because his birthday is soon and I don’t want to distract him with my problems. WIBTA for trying to talk to him,",
    "post_title":"WIBTA If I reached out to my friend?",
    "verdict":"YTA"
  },
  {
    "post_id":"11127r2",
    "post_content":"I (17F) am transgender and came out to my family in December of last year. They haven't used the correct pronouns for me a single time, claiming that \"they need time to adjust\". My mum put up some old pictures on the wall of the living room. One of them is an old photo of me. I hate looking at it because it reminds me of what people used to see me as and I get the feeling that my mum is still clinging on to the idea that I'm her son, not her daughter.<br/>She mentioned to me that she's grieving because she felt like she, quote, \"lost one of her sons\". I don't know if I could ask her to take that photo off the wall. WIBTA if I did?",
    "post_title":"WIBTA if I asked my mother to take down an old picture of me?",
    "verdict":"NTA"
  },
  {
    "post_id":"10y0sk1",
    "post_content":"So me and my family dad, mum and brother are finding a situation really hard. In 2018 we suddenly lost my nana (dads mum) to cancer. It was awful. My grandad now has a new ‘lady friend’ which we are all very happy of. We don’t want him spending his days locked up in his house watching tv for the rest of his life (he was 66 when my nana passed (his wife.) He lives 2 hours away but he pushed it on us to meet his new girlfriend and she came to our house as well which we felt a bit uncomfortable by. They’re very much a touchy romantic couple and honestly it’s so hard for all of us to see because of nana. He wants to come visit again with her but my dad took my nanas death the hardest and he just doesn’t want to see them together but we have no idea how to talk to him and tell him we don’t want to see her with him at the moment. Are we the assholes?",
    "post_title":"AITA for not wanting to see my grandads new girlfriend?",
    "verdict":"YTA"
  },
  {
    "post_id":"110t6au",
    "post_content":"Last month, I watched Dawn Of The Dead (the 2000s version) with my parents during the weekend (I am 16M so they thought I was old enough). We were nearly done the movie, when we noticed that my 6-year old sister, Catherine, was watching along with us, from the doorway. She was crying because of how scary the movie was. So my parents told me to comfort Cathy, and bring her back to her room to go to bed.<br/>On Monday morning, Cathy woke me up for school as usual (she always wakes me up in very cute ways). So just to play a joke on her, I told her \"oh no, Cathy, get away! I'm going to EAT YOU!\" Catherine started screaming and she ran out of my room, and I followed her, pretending to be a zombie. I cornered her with her back against the wall, and she was crying and scared to death. Then I revealed to her that it was all just a joke; I'm not a zombie and nobody's going to eat her! Anyway, she still has nightmares about the movie.<br/>AITA?",
    "post_title":"AITA for scaring my little sister right after she watched Dawn Of The Dead?",
    "verdict":"YTA"
  },
  {
    "post_id":"10vjkyb",
    "post_content":"I (23m) recently just got engaged to my now fiancé (28m). I decided that i want to take my fiancé's last name. My mum is pretty upset with it and really doesn't want me too.<br/>For context why, I have my mums last name. My dad was a deadbeat so when he left mum changed my last name to hers. Mum has 3 other kids, 2 with the same last name as their dad and 1 with my step dads last name. Even after getting married she kept her last name because she didnt want me to feel like im not a part of the family. Now that im getting married and changing my name shes upset she will be the only one with her last name. AITA?",
    "post_title":"AITA for wanting to take my fiancé's last name and upsetting my mum",
    "verdict":"NTA"
  },
  {
    "post_id":"1110wfv",
    "post_content":"Over the weekend, my boyfriend (19m) and I (16f), hung out and while on his phone he got a text from a girl. So being very immature, i clicked on it and read what they were texting about. I saw a lot of things that I didn't like (her sending hearts, him telling her he was going to call her after work, etc.). I thought this was weird but I didn't say anything because we were hanging out. Well this morning, i woke up and thats all I could think about so I asked him about why she was sending him hearts and why he was saying other things. He said that she was having a hard time and that she wanted to talk to him which i'm fine with but the mood in the text just felt weird. He got upset because I asked about this and then brought up me talking to a lot of guys (i talk to him and 1 other guy). So was I in the wrong for bringing this up?",
    "post_title":"AITA for asking about another girl?",
    "verdict":"NTA"
  },
  {
    "post_id":"10weh14",
    "post_content":"We've been living together for a good while but had consistent issues where he's claimed that I don't clean up after myself. It got so bad we put a camera in the kitchen, and it showed I rarely go in and when I do I always clean up. My part of the chores are mostly cleaning up after myself and taking the trash out. The thing is as said before I rarely produce trash as I'm not using the kitchen much. He's been putting all the trash on the balcony and tells me to take it t the garbage. The past few days I just ignored it until he did it and he acted all passed. AITA?",
    "post_title":"AITA me my brother and nephew all live together but it seems like I'm consistently blamed for messes",
    "verdict":"YTA"
  },
  {
    "post_id":"10uv30i",
    "post_content":"I’m going to keep this as short as possible.<br/>my mum called me today and i mentioned that my younger brother was helping to clean out my aunties garden whilst she finished her uni work (i thought my brother already told mum), she said she would pay him for his work which he happily accepted and got everything done within maybe an hour and a half. mum got angry that my brother was helping out and started to yell saying she feeds him, let’s him wash there and gives him a place to stay so he should have done her garden first. i told her that those were things that she as a parent was supposed to do and this caused her to hang up. i think i’m the AH because i 1) neither me or my brother live with my mum so i don’t know if she still needs to look after us, 2) i told her about him working here and 3) i got involvedso AITA",
    "post_title":"AITA for telling mum she’s wrong?",
    "verdict":"NTA"
  },
  {
    "post_id":"10v9ucm",
    "post_content":"My bestfriend has a brachial plexus injury  in her shoulder that affects her entire arm. She can’t move it and it can’t be pulled on. I want her to come with me to a festival this summer and she really wants to go, but is worried about her arm. I told her to wear a bright coloured cast or make a fake one that way everyone just thinks her arm is broken and tries to avoid it. Obviously it’s still a bit riskier for her to be in a mosh pit, but I know that anyone who sees her with a cast will be just a bit more cautious around her. I know atleast I would be.<br/>She got mad at me and hasn’t even explained why she is mad. I feel bad because I just wanna have fun together and I’ve seen her disability hold her back from a lot of stuff and I know she does want to go. It’s an annual festival and when I went this year she was so upset that she didn’t, so I wanna make it so she can this year",
    "post_title":"AITA for telling my bestfriend to wear a fake cast to a concert",
    "verdict":"YTA"
  },
  {
    "post_id":"10wahre",
    "post_content":"Me (19M) and my friend (20M) are both in college. Currently he’s working at a grocery store and told me he wanted to quit his job so he can make money off his artwork. He said he planned to quit at the start of summer and then start making money from commissions on twitter. He told him that was a bad idea considering that AI has become such a big thing. He said it’s fine and that he actually wanted to work with AI for inspiration. I argued that by saying that AI just does the whole job. He got mad telling me he’d been working on improving in art for almost a year.<br/>I kept telling him to at least not quit his job but he was dead set on doing so. After that I blew up telling him that he probably won’t even make any money considering that he’s pretty much a amateur. I said “Why would anyone pay for your art when a AI could do it better than you!”. He got quite then didn’t say anything. After a few days he said he’d given up on Art completely. Am I the asshole?",
    "post_title":"AITA for Killing my friend’s dream.",
    "verdict":"YTA"
  }
]